ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>CLOCKS</name>
            <baseAddress>0x40008000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>200</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CLOCKS_IRQ</name>
                <value>17</value>
            </interrupt>
            <registers>
                <register>
                    <name>CLK_GPOUT0_CTRL</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NUDGE</name>
                            <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHASE</name>
                            <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DC50</name>
                            <description>Enables duty cycle correction for odd divisors</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Starts and stops the clock generator cleanly</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KILL</name>
                            <description>Asynchronously kills the clock generator</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXSRC</name>
                            <description>Selects the auxiliary clock source, will glitch when switching</description>
                            <bitRange>[8:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>clksrc_pll_sys</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin0</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin1</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_pll_usb</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rosc_clksrc</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xosc_clksrc</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_sys</name>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_usb</name>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_adc</name>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_rtc</name>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_ref</name>
                                    <value>10</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_GPOUT0_DIV</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Clock divisor, can be changed on-the-fly</description>
                    <resetValue>0x00000100</resetValue>
                    <fields>
                        <field>
                            <name>INT</name>
                            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
                            <bitRange>[31:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRAC</name>
                            <description>Fractional component of the divisor</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_GPOUT0_SELECTED</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).</description>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>CLK_GPOUT0_SELECTED</name>
                            <description>This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_GPOUT1_CTRL</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NUDGE</name>
                            <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHASE</name>
                            <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DC50</name>
                            <description>Enables duty cycle correction for odd divisors</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Starts and stops the clock generator cleanly</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KILL</name>
                            <description>Asynchronously kills the clock generator</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXSRC</name>
                            <description>Selects the auxiliary clock source, will glitch when switching</description>
                            <bitRange>[8:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>clksrc_pll_sys</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin0</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin1</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_pll_usb</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rosc_clksrc</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xosc_clksrc</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_sys</name>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_usb</name>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_adc</name>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_rtc</name>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_ref</name>
                                    <value>10</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_GPOUT1_DIV</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>Clock divisor, can be changed on-the-fly</description>
                    <resetValue>0x00000100</resetValue>
                    <fields>
                        <field>
                            <name>INT</name>
                            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
                            <bitRange>[31:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRAC</name>
                            <description>Fractional component of the divisor</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_GPOUT1_SELECTED</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).</description>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>CLK_GPOUT1_SELECTED</name>
                            <description>This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_GPOUT2_CTRL</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NUDGE</name>
                            <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHASE</name>
                            <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DC50</name>
                            <description>Enables duty cycle correction for odd divisors</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Starts and stops the clock generator cleanly</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KILL</name>
                            <description>Asynchronously kills the clock generator</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXSRC</name>
                            <description>Selects the auxiliary clock source, will glitch when switching</description>
                            <bitRange>[8:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>clksrc_pll_sys</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin0</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin1</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_pll_usb</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rosc_clksrc_ph</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xosc_clksrc</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_sys</name>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_usb</name>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_adc</name>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_rtc</name>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_ref</name>
                                    <value>10</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_GPOUT2_DIV</name>
                    <addressOffset>0x0000001c</addressOffset>
                    <description>Clock divisor, can be changed on-the-fly</description>
                    <resetValue>0x00000100</resetValue>
                    <fields>
                        <field>
                            <name>INT</name>
                            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
                            <bitRange>[31:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRAC</name>
                            <description>Fractional component of the divisor</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_GPOUT2_SELECTED</name>
                    <addressOffset>0x00000020</addressOffset>
                    <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).</description>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>CLK_GPOUT2_SELECTED</name>
                            <description>This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
