ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>CLK_USB_CTRL</name>
                    <addressOffset>0x00000054</addressOffset>
                    <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NUDGE</name>
                            <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHASE</name>
                            <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Starts and stops the clock generator cleanly</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KILL</name>
                            <description>Asynchronously kills the clock generator</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXSRC</name>
                            <description>Selects the auxiliary clock source, will glitch when switching</description>
                            <bitRange>[7:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>clksrc_pll_usb</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_pll_sys</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rosc_clksrc_ph</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xosc_clksrc</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin0</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin1</name>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_USB_DIV</name>
                    <addressOffset>0x00000058</addressOffset>
                    <description>Clock divisor, can be changed on-the-fly</description>
                    <resetValue>0x00000100</resetValue>
                    <fields>
                        <field>
                            <name>INT</name>
                            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_USB_SELECTED</name>
                    <addressOffset>0x0000005c</addressOffset>
                    <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).</description>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>CLK_USB_SELECTED</name>
                            <description>This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_ADC_CTRL</name>
                    <addressOffset>0x00000060</addressOffset>
                    <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NUDGE</name>
                            <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHASE</name>
                            <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Starts and stops the clock generator cleanly</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KILL</name>
                            <description>Asynchronously kills the clock generator</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXSRC</name>
                            <description>Selects the auxiliary clock source, will glitch when switching</description>
                            <bitRange>[7:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>clksrc_pll_usb</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_pll_sys</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rosc_clksrc_ph</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xosc_clksrc</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin0</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin1</name>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_ADC_DIV</name>
                    <addressOffset>0x00000064</addressOffset>
                    <description>Clock divisor, can be changed on-the-fly</description>
                    <resetValue>0x00000100</resetValue>
                    <fields>
                        <field>
                            <name>INT</name>
                            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_ADC_SELECTED</name>
                    <addressOffset>0x00000068</addressOffset>
                    <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).</description>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>CLK_ADC_SELECTED</name>
                            <description>This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_RTC_CTRL</name>
                    <addressOffset>0x0000006c</addressOffset>
                    <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NUDGE</name>
                            <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHASE</name>
                            <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Starts and stops the clock generator cleanly</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KILL</name>
                            <description>Asynchronously kills the clock generator</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXSRC</name>
                            <description>Selects the auxiliary clock source, will glitch when switching</description>
                            <bitRange>[7:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>clksrc_pll_usb</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_pll_sys</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rosc_clksrc_ph</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xosc_clksrc</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin0</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin1</name>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_RTC_DIV</name>
                    <addressOffset>0x00000070</addressOffset>
                    <description>Clock divisor, can be changed on-the-fly</description>
                    <resetValue>0x00000100</resetValue>
                    <fields>
                        <field>
                            <name>INT</name>
                            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
                            <bitRange>[31:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRAC</name>
                            <description>Fractional component of the divisor</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_RTC_SELECTED</name>
                    <addressOffset>0x00000074</addressOffset>
                    <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).</description>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>CLK_RTC_SELECTED</name>
                            <description>This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_SYS_RESUS_CTRL</name>
                    <addressOffset>0x00000078</addressOffset>
                    <resetValue>0x000000ff</resetValue>
                    <fields>
                        <field>
                            <name>CLEAR</name>
                            <description>For clearing the resus after the fault that triggered it has been corrected</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRCE</name>
                            <description>Force a resus, for test purposes only</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Enable resus</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMEOUT</name>
                            <description>This is expressed as a number of clk_ref cycles 
                            and must be &gt;= 2x clk_ref_freq/min_clk_tst_freq</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_SYS_RESUS_STATUS</name>
                    <addressOffset>0x0000007c</addressOffset>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RESUSSED</name>
                            <description>Clock has been resuscitated, correct the error then send ctrl_clear=1</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FC0_REF_KHZ</name>
                    <addressOffset>0x00000080</addressOffset>
                    <description>Reference clock frequency in kHz</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FC0_REF_KHZ</name>
                            <bitRange>[19:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FC0_MIN_KHZ</name>
                    <addressOffset>0x00000084</addressOffset>
                    <description>Minimum pass frequency in kHz. This is optional. Set to 0 if you are not using the pass/fail flags</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FC0_MIN_KHZ</name>
                            <bitRange>[24:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FC0_MAX_KHZ</name>
                    <addressOffset>0x00000088</addressOffset>
                    <description>Maximum pass frequency in kHz. This is optional. Set to 0x1ffffff if you are not using the pass/fail flags</description>
                    <resetValue>0x01ffffff</resetValue>
                    <fields>
                        <field>
                            <name>FC0_MAX_KHZ</name>
                            <bitRange>[24:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FC0_DELAY</name>
                    <addressOffset>0x0000008c</addressOffset>
                    <description>Delays the start of frequency counting to allow the mux to settle 
                    Delay is measured in multiples of the reference clock period</description>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>FC0_DELAY</name>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FC0_INTERVAL</name>
                    <addressOffset>0x00000090</addressOffset>
                    <description>The test interval is 0.98us * 2**interval, but let's call it 1us * 2**interval 
                    The default gives a test interval of 250us</description>
                    <resetValue>0x00000008</resetValue>
                    <fields>
                        <field>
                            <name>FC0_INTERVAL</name>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
