ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>FC0_SRC</name>
                    <addressOffset>0x00000094</addressOffset>
                    <description>Clock sent to frequency counter, set to 0 when not required 
                    Writing to this register initiates the frequency count</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FC0_SRC</name>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NULL</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>pll_sys_clksrc_primary</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>pll_usb_clksrc_primary</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rosc_clksrc</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rosc_clksrc_ph</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xosc_clksrc</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin0</name>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clksrc_gpin1</name>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_ref</name>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_sys</name>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_peri</name>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_usb</name>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_adc</name>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>clk_rtc</name>
                                    <value>13</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FC0_STATUS</name>
                    <addressOffset>0x00000098</addressOffset>
                    <description>Frequency counter status</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIED</name>
                            <description>Test clock stopped during test</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FAST</name>
                            <description>Test clock faster than expected, only valid when status_done=1</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SLOW</name>
                            <description>Test clock slower than expected, only valid when status_done=1</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FAIL</name>
                            <description>Test failed</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WAITING</name>
                            <description>Waiting for test clock to start</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RUNNING</name>
                            <description>Test running</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DONE</name>
                            <description>Test complete</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PASS</name>
                            <description>Test passed</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FC0_RESULT</name>
                    <addressOffset>0x0000009c</addressOffset>
                    <description>Result of frequency measurement, only valid when status_done=1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>KHZ</name>
                            <bitRange>[29:5]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FRAC</name>
                            <bitRange>[4:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WAKE_EN0</name>
                    <addressOffset>0x000000a0</addressOffset>
                    <description>enable clock in wake mode</description>
                    <resetValue>0xffffffff</resetValue>
                    <fields>
                        <field>
                            <name>CLK_SYS_SRAM3</name>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SRAM2</name>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SRAM1</name>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SRAM0</name>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SPI1</name>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_PERI_SPI1</name>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SPI0</name>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_PERI_SPI0</name>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SIO</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_RTC</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_RTC_RTC</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_ROSC</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_ROM</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_RESETS</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_PWM</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_PSM</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_PLL_USB</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_PLL_SYS</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_PIO1</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_PIO0</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_PADS</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_VREG_AND_CHIP_RESET</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_JTAG</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_IO</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_I2C1</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_I2C0</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_DMA</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_BUSFABRIC</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_BUSCTRL</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_ADC</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_ADC_ADC</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_CLOCKS</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WAKE_EN1</name>
                    <addressOffset>0x000000a4</addressOffset>
                    <description>enable clock in wake mode</description>
                    <resetValue>0x00007fff</resetValue>
                    <fields>
                        <field>
                            <name>CLK_SYS_XOSC</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_XIP</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_WATCHDOG</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_USB_USBCTRL</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_USBCTRL</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_UART1</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_PERI_UART1</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_UART0</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_PERI_UART0</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_TIMER</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_TBMAN</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SYSINFO</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SYSCFG</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SRAM5</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SYS_SRAM4</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
