ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>INTE</name>
                    <addressOffset>0x000000bc</addressOffset>
                    <description>Interrupt Enable</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLK_SYS_RESUS</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF</name>
                    <addressOffset>0x000000c0</addressOffset>
                    <description>Interrupt Force</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLK_SYS_RESUS</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTS</name>
                    <addressOffset>0x000000c4</addressOffset>
                    <description>Interrupt status after masking &amp; forcing</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLK_SYS_RESUS</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PADS_BANK0</name>
            <baseAddress>0x4001c000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>132</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>VOLTAGE_SELECT</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Voltage select. Per bank control</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VOLTAGE_SELECT</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>3v3</name>
                                    <value>0</value>
                                    <description>Set voltage to 3.3V (DVDD &gt;= 2V5)</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1v8</name>
                                    <value>1</value>
                                    <description>Set voltage to 1.8V (DVDD &lt;= 1V8)</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO0</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Pad control register</description>
                    <resetValue>0x00000056</resetValue>
                    <fields>
                        <field>
                            <name>OD</name>
                            <description>Output disable. Has priority over output enable from peripherals</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>Input enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRIVE</name>
                            <description>Drive strength.</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2mA</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4mA</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8mA</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>12mA</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PUE</name>
                            <description>Pull up enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDE</name>
                            <description>Pull down enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHMITT</name>
                            <description>Enable schmitt trigger</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLEWFAST</name>
                            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO1</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>Pad control register</description>
                    <resetValue>0x00000056</resetValue>
                    <fields>
                        <field>
                            <name>OD</name>
                            <description>Output disable. Has priority over output enable from peripherals</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>Input enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRIVE</name>
                            <description>Drive strength.</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2mA</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4mA</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8mA</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>12mA</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PUE</name>
                            <description>Pull up enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDE</name>
                            <description>Pull down enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHMITT</name>
                            <description>Enable schmitt trigger</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLEWFAST</name>
                            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO2</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>Pad control register</description>
                    <resetValue>0x00000056</resetValue>
                    <fields>
                        <field>
                            <name>OD</name>
                            <description>Output disable. Has priority over output enable from peripherals</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>Input enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRIVE</name>
                            <description>Drive strength.</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2mA</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4mA</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8mA</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>12mA</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PUE</name>
                            <description>Pull up enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDE</name>
                            <description>Pull down enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHMITT</name>
                            <description>Enable schmitt trigger</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLEWFAST</name>
                            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO3</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>Pad control register</description>
                    <resetValue>0x00000056</resetValue>
                    <fields>
                        <field>
                            <name>OD</name>
                            <description>Output disable. Has priority over output enable from peripherals</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>Input enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRIVE</name>
                            <description>Drive strength.</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2mA</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4mA</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8mA</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>12mA</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PUE</name>
                            <description>Pull up enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDE</name>
                            <description>Pull down enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHMITT</name>
                            <description>Enable schmitt trigger</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLEWFAST</name>
                            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO4</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>Pad control register</description>
                    <resetValue>0x00000056</resetValue>
                    <fields>
                        <field>
                            <name>OD</name>
                            <description>Output disable. Has priority over output enable from peripherals</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>Input enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRIVE</name>
                            <description>Drive strength.</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2mA</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4mA</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8mA</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>12mA</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PUE</name>
                            <description>Pull up enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDE</name>
                            <description>Pull down enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHMITT</name>
                            <description>Enable schmitt trigger</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLEWFAST</name>
                            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO5</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>Pad control register</description>
                    <resetValue>0x00000056</resetValue>
                    <fields>
                        <field>
                            <name>OD</name>
                            <description>Output disable. Has priority over output enable from peripherals</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>Input enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRIVE</name>
                            <description>Drive strength.</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2mA</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4mA</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8mA</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>12mA</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PUE</name>
                            <description>Pull up enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDE</name>
                            <description>Pull down enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHMITT</name>
                            <description>Enable schmitt trigger</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLEWFAST</name>
                            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
