ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>IO_QSPI</name>
            <baseAddress>0x40018000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>88</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>IO_IRQ_QSPI</name>
                <value>14</value>
            </interrupt>
            <registers>
                <register>
                    <name>GPIO_QSPI_SCLK_STATUS</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>GPIO status</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IRQTOPROC</name>
                            <description>interrupt to processors, after override is applied</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRQFROMPAD</name>
                            <description>interrupt from pad before override is applied</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INTOPERI</name>
                            <description>input signal to peripheral, after override is applied</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INFROMPAD</name>
                            <description>input signal from pad, before override is applied</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OETOPAD</name>
                            <description>output enable to pad after register override is applied</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OEFROMPERI</name>
                            <description>output enable from selected peripheral, before register override is applied</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTTOPAD</name>
                            <description>output signal to pad after register override is applied</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTFROMPERI</name>
                            <description>output signal from selected peripheral, before register override is applied</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_QSPI_SCLK_CTRL</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>GPIO control including function select and overrides.</description>
                    <resetValue>0x0000001f</resetValue>
                    <fields>
                        <field>
                            <name>IRQOVER</name>
                            <bitRange>[29:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <value>0</value>
                                    <description>don't invert the interrupt</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INVERT</name>
                                    <value>1</value>
                                    <description>invert the interrupt</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>2</value>
                                    <description>drive interrupt low</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>3</value>
                                    <description>drive interrupt high</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INOVER</name>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <value>0</value>
                                    <description>don't invert the peri input</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INVERT</name>
                                    <value>1</value>
                                    <description>invert the peri input</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>2</value>
                                    <description>drive peri input low</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>3</value>
                                    <description>drive peri input high</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OEOVER</name>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <value>0</value>
                                    <description>drive output enable from peripheral signal selected by funcsel</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INVERT</name>
                                    <value>1</value>
                                    <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <value>2</value>
                                    <description>disable output</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <value>3</value>
                                    <description>enable output</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OUTOVER</name>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <value>0</value>
                                    <description>drive output from peripheral signal selected by funcsel</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INVERT</name>
                                    <value>1</value>
                                    <description>drive output from inverse of peripheral signal selected by funcsel</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>2</value>
                                    <description>drive output low</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>3</value>
                                    <description>drive output high</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FUNCSEL</name>
                            <description>0-31 -&gt; selects pin function according to the gpio table 
                            31 == NULL</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>xip_sclk</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sio_30</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>null</name>
                                    <value>31</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_QSPI_SS_STATUS</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>GPIO status</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IRQTOPROC</name>
                            <description>interrupt to processors, after override is applied</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRQFROMPAD</name>
                            <description>interrupt from pad before override is applied</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INTOPERI</name>
                            <description>input signal to peripheral, after override is applied</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INFROMPAD</name>
                            <description>input signal from pad, before override is applied</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OETOPAD</name>
                            <description>output enable to pad after register override is applied</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OEFROMPERI</name>
                            <description>output enable from selected peripheral, before register override is applied</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTTOPAD</name>
                            <description>output signal to pad after register override is applied</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTFROMPERI</name>
                            <description>output signal from selected peripheral, before register override is applied</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_QSPI_SS_CTRL</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>GPIO control including function select and overrides.</description>
                    <resetValue>0x0000001f</resetValue>
                    <fields>
                        <field>
                            <name>IRQOVER</name>
                            <bitRange>[29:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <value>0</value>
                                    <description>don't invert the interrupt</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INVERT</name>
                                    <value>1</value>
                                    <description>invert the interrupt</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>2</value>
                                    <description>drive interrupt low</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>3</value>
                                    <description>drive interrupt high</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INOVER</name>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <value>0</value>
                                    <description>don't invert the peri input</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INVERT</name>
                                    <value>1</value>
                                    <description>invert the peri input</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>2</value>
                                    <description>drive peri input low</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>3</value>
                                    <description>drive peri input high</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OEOVER</name>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <value>0</value>
                                    <description>drive output enable from peripheral signal selected by funcsel</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INVERT</name>
                                    <value>1</value>
                                    <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <value>2</value>
                                    <description>disable output</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <value>3</value>
                                    <description>enable output</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OUTOVER</name>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <value>0</value>
                                    <description>drive output from peripheral signal selected by funcsel</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INVERT</name>
                                    <value>1</value>
                                    <description>drive output from inverse of peripheral signal selected by funcsel</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>2</value>
                                    <description>drive output low</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>3</value>
                                    <description>drive output high</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FUNCSEL</name>
                            <description>0-31 -&gt; selects pin function according to the gpio table 
                            31 == NULL</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>xip_ss_n</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sio_31</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>null</name>
                                    <value>31</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
