ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>INTR</name>
                    <addressOffset>0x00000030</addressOffset>
                    <description>Raw Interrupts</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD3_EDGE_LOW</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_EDGE_LOW</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_EDGE_LOW</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_EDGE_LOW</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_EDGE_HIGH</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_EDGE_LOW</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_LEVEL_LOW</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PROC0_INTE</name>
                    <addressOffset>0x00000034</addressOffset>
                    <description>Interrupt Enable for proc0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD3_EDGE_LOW</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_EDGE_LOW</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_EDGE_LOW</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_EDGE_LOW</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_EDGE_HIGH</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_EDGE_LOW</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_LEVEL_LOW</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PROC0_INTF</name>
                    <addressOffset>0x00000038</addressOffset>
                    <description>Interrupt Force for proc0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD3_EDGE_LOW</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_EDGE_LOW</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_EDGE_LOW</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_EDGE_LOW</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_EDGE_HIGH</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_EDGE_LOW</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SS_LEVEL_LOW</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
