ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>DORMANT_WAKE_INTE1</name>
                    <addressOffset>0x00000164</addressOffset>
                    <description>Interrupt Enable for dormant_wake</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO15_EDGE_HIGH</name>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO15_EDGE_LOW</name>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO15_LEVEL_HIGH</name>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO15_LEVEL_LOW</name>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO14_EDGE_HIGH</name>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO14_EDGE_LOW</name>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO14_LEVEL_HIGH</name>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO14_LEVEL_LOW</name>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO13_EDGE_HIGH</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO13_EDGE_LOW</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO13_LEVEL_HIGH</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO13_LEVEL_LOW</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO12_EDGE_HIGH</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO12_EDGE_LOW</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO12_LEVEL_HIGH</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO12_LEVEL_LOW</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO11_EDGE_HIGH</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO11_EDGE_LOW</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO11_LEVEL_HIGH</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO11_LEVEL_LOW</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO10_EDGE_HIGH</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO10_EDGE_LOW</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO10_LEVEL_HIGH</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO10_LEVEL_LOW</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO9_EDGE_HIGH</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO9_EDGE_LOW</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO9_LEVEL_HIGH</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO9_LEVEL_LOW</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO8_EDGE_HIGH</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO8_EDGE_LOW</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO8_LEVEL_HIGH</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO8_LEVEL_LOW</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DORMANT_WAKE_INTE2</name>
                    <addressOffset>0x00000168</addressOffset>
                    <description>Interrupt Enable for dormant_wake</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO23_EDGE_HIGH</name>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO23_EDGE_LOW</name>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO23_LEVEL_HIGH</name>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO23_LEVEL_LOW</name>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO22_EDGE_HIGH</name>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO22_EDGE_LOW</name>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO22_LEVEL_HIGH</name>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO22_LEVEL_LOW</name>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO21_EDGE_HIGH</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO21_EDGE_LOW</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO21_LEVEL_HIGH</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO21_LEVEL_LOW</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO20_EDGE_HIGH</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO20_EDGE_LOW</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO20_LEVEL_HIGH</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO20_LEVEL_LOW</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO19_EDGE_HIGH</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO19_EDGE_LOW</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO19_LEVEL_HIGH</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO19_LEVEL_LOW</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO18_EDGE_HIGH</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO18_EDGE_LOW</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO18_LEVEL_HIGH</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO18_LEVEL_LOW</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO17_EDGE_HIGH</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO17_EDGE_LOW</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO17_LEVEL_HIGH</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO17_LEVEL_LOW</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO16_EDGE_HIGH</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO16_EDGE_LOW</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO16_LEVEL_HIGH</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO16_LEVEL_LOW</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DORMANT_WAKE_INTE3</name>
                    <addressOffset>0x0000016c</addressOffset>
                    <description>Interrupt Enable for dormant_wake</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO29_EDGE_HIGH</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO29_EDGE_LOW</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO29_LEVEL_HIGH</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO29_LEVEL_LOW</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO28_EDGE_HIGH</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO28_EDGE_LOW</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO28_LEVEL_HIGH</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO28_LEVEL_LOW</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO27_EDGE_HIGH</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO27_EDGE_LOW</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO27_LEVEL_HIGH</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO27_LEVEL_LOW</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO26_EDGE_HIGH</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO26_EDGE_LOW</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO26_LEVEL_HIGH</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO26_LEVEL_LOW</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO25_EDGE_HIGH</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO25_EDGE_LOW</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO25_LEVEL_HIGH</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO25_LEVEL_LOW</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO24_EDGE_HIGH</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO24_EDGE_LOW</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO24_LEVEL_HIGH</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO24_LEVEL_LOW</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
