ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>SYSINFO</name>
            <baseAddress>0x40000000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CHIP_ID</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>JEDEC JEP-106 compliant chip identifier.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REVISION</name>
                            <bitRange>[31:28]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PART</name>
                            <bitRange>[27:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MANUFACTURER</name>
                            <bitRange>[11:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLATFORM</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Platform register. Allows software to know what environment it is running in.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ASIC</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FPGA</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GITREF_RP2040</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>Git hash of the chip source. Used to identify chip version.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>GITREF_RP2040</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PPB</name>
            <description>Cortex-M0+ Private Peripheral Bus</description>
            <baseAddress>0xE0000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <cluster>
                    <name>DWT</name>
                    <description>Data Watchpoint and Trace</description>
                    <addressOffset>0x1000</addressOffset>
                    <register>
                        <name>DWT_CTRL</name>
                        <displayName>Control register</displayName>
                        <description>Provides configuration and status information for the DWT unit, and used to control features of the unit</description>
                        <addressOffset>0x0</addressOffset>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>NUMCOMP</name>
                                <description>Number of comparators implemented</description>
                                <bitRange>[31:28]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>DWT_PCSR</name>
                        <displayName>Program Counter Sample Register</displayName>
                        <description>Samples the current value of the program counter</description>
                        <addressOffset>0x1C</addressOffset>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>EIASAMPLE</name>
                                <description>Executed Instruction Address sample value</description>
                                <bitRange>[31:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>DWT_COMP_%s</name>
                        <displayName>Comparator register</displayName>
                        <description>Provides a reference value for use by comparator n</description>
                        <addressOffset>0x20</addressOffset>
                        <dim>8</dim>
                        <dimIncrement>4</dimIncrement>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>COMP</name>
                                <description>Reference value for comparison</description>
                                <bitRange>[31:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>DWT_MASK_%s</name>
                        <displayName>Comparator Mask register %s</displayName>
                        <description>Provides the size of the ignore mask applied to the access address for address range matching by comparator n</description>
                        <addressOffset>0x24</addressOffset>
                        <dim>8</dim>
                        <dimIncrement>4</dimIncrement>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>MASK</name>
                                <description>The size of the ignore mask, 0-31 bits, applied to address range matching</description>
                                <bitRange>[4:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>DWT_FUNCTION_%s</name>
                        <displayName>Comparator Function register %s</displayName>
                        <description>Controls the operation of comparator n</description>
                        <addressOffset>0x28</addressOffset>
                        <dim>8</dim>
                        <dimIncrement>4</dimIncrement>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>MATCHED</name>
                                <description>Comparator match</description>
                                <bitRange>[24:24]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No match</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Match</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>FUNCTION</name>
                                <description>Selects action taken on comparator match</description>
                                <bitRange>[3:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <name>BPU</name>
                    <description>Breakpoint Unit</description>
                    <addressOffset>0x2000</addressOffset>
                    <register>
                        <name>BP_CTRL</name>
                        <displayName>Breakpoint Control Register</displayName>
                        <description>Provides BPU implementation information, and the global enable for the BPU</description>
                        <addressOffset>0x0</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>NUM_CODE</name>
                                <description>The number of breakpoint comparators</description>
                                <bitRange>[7:4]</bitRange>
                            </field>
                            <field>
                                <name>KEY</name>
                                <description>On any write to FP_CTRL, this bit must be 1</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>ENABLE</name>
                                <description>Enable bit for the FPB</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Flash Patch Breakpoint disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Flash Patch Breakpoint enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>BP_COMP_%s</name>
                        <displayName>Breakpoint Comparator Register %s</displayName>
                        <description>
                Holds a breakpoint address for comparison with instruction addresses in the Code
                memory region
              </description>
                        <addressOffset>0x8</addressOffset>
                        <dim>8</dim>
                        <dimIncrement>4</dimIncrement>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>BP_MATCH</name>
                                <description>defines the behavior when the COMP address is matched</description>
                                <bitRange>[31:30]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>no breakpoint matching</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Breakpoint on lower halfword, upper is unaffected</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val2</name>
                                        <description>Breakpoint on upper halfword, lower is unaffected</description>
                                        <value>2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val3</name>
                                        <description>Breakpoint on both lower and upper halfwords</description>
                                        <value>3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>COMP</name>
                                <description>Stores bits [28:2] of the comparison address</description>
                                <bitRange>[28:2]</bitRange>
                            </field>
                            <field>
                                <name>BE</name>
                                <description>enables the comperator</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <name>ICB</name>
                    <description>Implementation Control Block</description>
                    <addressOffset>0xE008</addressOffset>
                    <register>
                        <name>ACTLR</name>
                        <displayName>Auxiliary Control Register</displayName>
                        <description>Provides IMPLEMENTATION DEFINED configuration and control options</description>
                        <addressOffset>0x0</addressOffset>
                        <access>read-write</access>
                    </register>
                </cluster>
                <cluster>
                    <name>SYSTICK</name>
                    <description>SysTick Timer</description>
                    <addressOffset>0xE010</addressOffset>
                    <register>
                        <name>SYST_CSR</name>
                        <displayName>SysTick Control and Status Register</displayName>
                        <description>Controls the system timer and provides status data</description>
                        <addressOffset>0x0</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>COUNTFLAG</name>
                                <description>Indicates whether the counter has counted to 0 since the last read of this register</description>
                                <bitRange>[16:16]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Timer has not counted to 0</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Timer has counted to 0</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>CLKSOURCE</name>
                                <description>Indicates the SysTick clock source</description>
                                <bitRange>[2:2]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>SysTick uses the IMPLEMENTATION DEFINED external reference clock</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>SysTick uses the processor clock</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>TICKINT</name>
                                <description>Indicates whether counting to 0 causes the status of the SysTick exception to change to pending</description>
                                <bitRange>[1:1]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Count to 0 does not affect the SysTick exception status</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Count to 0 changes the SysTick exception status to pending</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>ENABLE</name>
                                <description>Indicates the enabled status of the SysTick counter</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Counter is disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Counter is operating</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>SYST_RVR</name>
                        <displayName>SysTick Reload Value Register</displayName>
                        <description>Holds the reload value of the SYST_CVR</description>
                        <addressOffset>0x4</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>RELOAD</name>
                                <description>The value to load into the SYST_CVR when the counter reaches 0</description>
                                <bitRange>[23:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>SYST_CVR</name>
                        <displayName>SysTick Current Value Register</displayName>
                        <description>Reads or clears the current counter value</description>
                        <addressOffset>0x8</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CURRENT</name>
                                <description>Current counter value</description>
                                <bitRange>[31:0]</bitRange>
                            </field>
                        </fields>
                    </register>
