ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                    <register>
                        <name>SYST_CALIB</name>
                        <displayName>SysTick Calibration value Register</displayName>
                        <description>Reads the calibration value and parameters for SysTick</description>
                        <addressOffset>0xC</addressOffset>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>NOREF</name>
                                <description>Indicates whether the IMPLEMENTATION DEFINED reference clock is implemented</description>
                                <bitRange>[31:31]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>The reference clock is implemented</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>The reference clock is not implemented</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>SKEW</name>
                                <description>Indicates whether the 10ms calibration value is exact</description>
                                <bitRange>[30:30]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>10ms calibration value is exact</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>10ms calibration value is inexact, because of the clock frequency</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>TENMS</name>
                                <description>Optionally, holds a reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors</description>
                                <bitRange>[23:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <name>NVIC</name>
                    <description>Nested Vectored Interrupt Controller</description>
                    <addressOffset>0xE100</addressOffset>
                    <register>
                        <name>NVIC_ISER_%s</name>
                        <displayName>Interrupt Set-Enable Register %s</displayName>
                        <description>Enables, or reads the enable state of a group of interrupts</description>
                        <addressOffset>0x0</addressOffset>
                        <dim>16</dim>
                        <dimIncrement>4</dimIncrement>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>SETENA_%s</name>
                                <description>For register NVIC_ISERn, enables or shows the current enabled state of interrupt (m+(32*n))</description>
                                <bitRange>[0:0]</bitRange>
                                <dim>32</dim>
                                <dimIncrement>1</dimIncrement>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>On reads, interrupt disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>On reads, interrupt enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>NVIC_ICER_%s</name>
                        <displayName>Interrupt Clear-Enable Register %s</displayName>
                        <description>Disables, or reads the enable state of, a group of registers</description>
                        <addressOffset>0x80</addressOffset>
                        <dim>16</dim>
                        <dimIncrement>4</dimIncrement>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CLRENA_%s</name>
                                <description>For register NVIC_ICERn, disables or shows the current enabled state of interrupt (m+(32*n))</description>
                                <bitRange>[0:0]</bitRange>
                                <dim>32</dim>
                                <dimIncrement>1</dimIncrement>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>On reads, interrupt disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>On reads, interrupt enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>NVIC_ISPR_%s</name>
                        <displayName>Interrupt Set-Pending Register %s</displayName>
                        <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending status</description>
                        <addressOffset>0x100</addressOffset>
                        <dim>16</dim>
                        <dimIncrement>4</dimIncrement>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>SETPEND_%s</name>
                                <description>For register NVIC_ISPRn, changes the state of interrupt (m+(32*n)) to pending, or shows whether the state of the interrupt is pending</description>
                                <bitRange>[0:0]</bitRange>
                                <dim>32</dim>
                                <dimIncrement>1</dimIncrement>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>On reads, interrupt is not pending</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>On reads, interrupt is pending</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>NVIC_ICPR_%s</name>
                        <displayName>Interrupt Clear-Pending Register %s</displayName>
                        <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending status</description>
                        <addressOffset>0x180</addressOffset>
                        <dim>16</dim>
                        <dimIncrement>4</dimIncrement>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CLRPEND_%s</name>
                                <description>For register NVIC_ICPRn, clears the pending state of interrupt (m+(32*n)), or shows whether the state of the interrupt is pending</description>
                                <bitRange>[0:0]</bitRange>
                                <dim>32</dim>
                                <dimIncrement>1</dimIncrement>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>On reads, interrupt is not pending</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>On reads, interrupt is pending</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>NVIC_IPR_%s</name>
                        <displayName>Interrupt Priority Register %s</displayName>
                        <description>Sets or reads interrupt priorities</description>
                        <addressOffset>0x300</addressOffset>
                        <dim>124</dim>
                        <dimIncrement>4</dimIncrement>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>PRI_N3</name>
                                <description>For register NVIC_IPRn, priority of interrupt number 4n+3</description>
                                <bitRange>[31:24]</bitRange>
                            </field>
                            <field>
                                <name>PRI_N2</name>
                                <description>For register NVIC_IPRn, priority of interrupt number 4n+2</description>
                                <bitRange>[23:16]</bitRange>
                            </field>
                            <field>
                                <name>PRI_N1</name>
                                <description>For register NVIC_IPRn, priority of interrupt number 4n+1</description>
                                <bitRange>[15:8]</bitRange>
                            </field>
                            <field>
                                <name>PRI_N0</name>
                                <description>For register NVIC_IPRn, priority of interrupt number 4n</description>
                                <bitRange>[7:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <name>SCB</name>
                    <description>System Control Block</description>
                    <addressOffset>0xED00</addressOffset>
                    <register>
                        <name>CPUID</name>
                        <displayName>CPUID Base Register</displayName>
                        <description>Provides identification information for the processor</description>
                        <addressOffset>0x0</addressOffset>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>IMPLEMENTER</name>
                                <description>Implementer code assigned by ARM</description>
                                <bitRange>[31:24]</bitRange>
                            </field>
                            <field>
                                <name>VARIANT</name>
                                <description>IMPLEMENTATION DEFINED variant number</description>
                                <bitRange>[23:20]</bitRange>
                            </field>
                            <field>
                                <name>ARCHITECTURE</name>
                                <description>Reads as 0xF</description>
                                <bitRange>[19:16]</bitRange>
                            </field>
                            <field>
                                <name>PARTNO</name>
                                <description>IMPLEMENTATION DEFINED part number</description>
                                <bitRange>[15:4]</bitRange>
                            </field>
                            <field>
                                <name>REVISION</name>
                                <description>IMPLEMENTATION DEFINED revision number</description>
                                <bitRange>[3:0]</bitRange>
                            </field>
                        </fields>
                    </register>
