ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                    <register>
                        <name>ICSR</name>
                        <displayName>Interrupt Control and State Register</displayName>
                        <description>Provides software control of the NMI, PendSV, and SysTick exceptions, and provides interrupt status information</description>
                        <addressOffset>0x4</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>NMIPENDSET</name>
                                <description>On writes, makes the NMI exception active</description>
                                <bitRange>[31:31]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>On writes, has no effect. On reads, NMI is inactive</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>On writes, make the NMI exception active. On reads, NMI is active</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>PENDSVSET</name>
                                <description>On writes, sets the PendSV exception as pending</description>
                                <bitRange>[28:28]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>On writes, has no effect. On reads, PendSV is not pending</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>On writes, make PendSV exception pending. On reads, PendSV is pending</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>PENDSVCLR</name>
                                <description>Removes the pending status of the PendSV exception</description>
                                <bitRange>[27:27]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No effect</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Remove pending status</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>PENDSTSET</name>
                                <description>On writes, sets the SysTick exception as pending</description>
                                <bitRange>[26:26]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>On writes, has no effect. On reads, SysTick is not pending</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>On writes, make SysTick exception pending. On reads, SysTick is pending</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>PENDSTCLR</name>
                                <description>Removes the pending status of the SysTick exception</description>
                                <bitRange>[25:25]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No effect</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Remove pending status</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>ISRPREEMPT</name>
                                <description>Indicates whether a pending exception will be serviced on exit from debug halt state</description>
                                <bitRange>[23:23]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Will not service</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Will service a pending exception</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>ISRPENDING</name>
                                <description>Indicates whether an external interrupt, generated by the NVIC, is pending</description>
                                <bitRange>[22:22]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No external interrupt pending</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>External interrupt pending</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VECTPENDING</name>
                                <description>The exception number of the highest priority pending and enabled interrupt</description>
                                <bitRange>[20:12]</bitRange>
                            </field>
                            <field>
                                <name>RETTOBASE</name>
                                <description>In Handler mode, indicates whether there is an active exception other than the exception indicated by the current value of the IPSR</description>
                                <bitRange>[11:11]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>There is an active exception other than the exception shown by IPSR</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>There is no active exception other than any exception shown by IPSR</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VECTACTIVE</name>
                                <description>The exception number of the current executing exception</description>
                                <bitRange>[8:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>VTOR</name>
                        <displayName>Vector Table Offset Register</displayName>
                        <description>Holds the vector table address</description>
                        <addressOffset>0x8</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>TBLOFF</name>
                                <description>Bits[31:7] of the vector table address</description>
                                <bitRange>[31:7]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>AIRCR</name>
                        <displayName>Application Interrupt and Reset Control Register</displayName>
                        <description>Sets or returns interrupt control data</description>
                        <addressOffset>0xC</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>VECTKEY</name>
                                <description>Vector Key. The value 0x05FA must be written to this register.</description>
                                <bitRange>[31:16]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Do not request a reset</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Request reset</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>ENDIANNESS</name>
                                <description>Indicates the memory system endianness</description>
                                <bitRange>[15:15]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Little endian</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Big endian</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>SYSRESETREQ</name>
                                <description>System Reset Request</description>
                                <bitRange>[2:2]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Do not request a reset</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Request reset</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VECTCLRACTIVE</name>
                                <description>Writing 1 to this bit clears all active state information for fixed and configurable exceptions</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>SCR</name>
                        <displayName>System Control Register</displayName>
                        <description>Sets or returns system control data</description>
                        <addressOffset>0x10</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>SEVONPEND</name>
                                <description>Determines whether an interrupt transition from inactive state to pending state is a wakeup event</description>
                                <bitRange>[4:4]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Transitions from inactive to pending are not wakeup events</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Transitions from inactive to pending are wakeup events</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>SLEEPDEEP</name>
                                <description>Provides a qualifying hint indicating that waking from sleep might take longer</description>
                                <bitRange>[2:2]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Selected sleep state is not deep sleep</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Selected sleep state is deep sleep</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>SLEEPONEXIT</name>
                                <description>Determines whether, on an exit from an ISR that returns to the base level of execution priority, the processor enters a sleep state</description>
                                <bitRange>[1:1]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Do not enter sleep state</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Enter sleep state</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>CCR</name>
                        <displayName>Configuration and Control Register</displayName>
                        <description>Sets or returns configuration and control data, and provides control over caching and branch prediction</description>
                        <addressOffset>0x14</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>STKALIGN</name>
                                <description>Determines whether the exception entry sequence guarantees 8-byte stack frame alignment, adjusting the SP if necessary before saving state</description>
                                <bitRange>[9:9]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Guaranteed SP alignment is 4-byte, no SP adjustment is performed</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>8-byte alignment guaranteed, SP adjusted if necessary</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>UNALIGN_TRP</name>
                                <description>Controls the trapping of unaligned word or halfword accesses</description>
                                <bitRange>[3:3]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Trapping disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Trapping enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>SHPR2</name>
                        <displayName>System Handler Priority Register 2</displayName>
                        <description>Sets or returns priority for system handlers 8-11</description>
                        <addressOffset>0x1C</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>PRI_11</name>
                                <description>Priority of system handler 11, SVCall</description>
                                <bitRange>[31:24]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>SHPR3</name>
                        <displayName>System Handler Priority Register 3</displayName>
                        <description>Sets or returns priority for system handlers 12-15</description>
                        <addressOffset>0x20</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>PRI_15</name>
                                <description>Priority of system handler 15, SysTick</description>
                                <bitRange>[31:24]</bitRange>
                            </field>
                            <field>
                                <name>PRI_14</name>
                                <description>Priority of system handler 14, PendSV</description>
                                <bitRange>[23:16]</bitRange>
                            </field>
                        </fields>
                    </register>
