ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                    <register>
                        <name>SHCSR</name>
                        <displayName>System Handler Control and State Register</displayName>
                        <description>Controls and provides the active and pending status of system exceptions</description>
                        <addressOffset>0x24</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>SVCALLPENDED</name>
                                <description />
                                <bitRange>[15:15]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>SVCall is not pending</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>SVCall is pending</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>DFSR</name>
                        <displayName>Debug Fault Status Register</displayName>
                        <description>Shows which debug event occurred</description>
                        <addressOffset>0x30</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>EXTERNAL</name>
                                <description>Indicates a debug event generated because of the assertion of an external debug request</description>
                                <bitRange>[4:4]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No external debug request debug event</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>External debug request debug event</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VCATCH</name>
                                <description>Indicates triggering of a Vector catch</description>
                                <bitRange>[3:3]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No Vector catch triggered</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Vector catch triggered</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>DWTTRAP</name>
                                <description>Indicates a debug event generated by the DWT</description>
                                <bitRange>[2:2]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No debug events generated by the DWT</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>At least one debug event generated by the DWT</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>BKPT</name>
                                <description>Indicates a debug event generated by BKPT instruction execution or a breakpoint match in FPB</description>
                                <bitRange>[1:1]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No breakpoint debug event</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>At least one breakpoint debug event</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>HALTED</name>
                                <description>Indicates a debug event generated by either a halt or step request</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No halt request debug event</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Halt request debug event</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <name>MPU</name>
                    <description>Memory Protection Unit</description>
                    <addressOffset>0xED90</addressOffset>
                    <register>
                        <name>MPU_TYPE</name>
                        <displayName>MPU Type Register</displayName>
                        <description>The MPU Type Register indicates how many regions the MPU support</description>
                        <addressOffset>0x0</addressOffset>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>IREGION</name>
                                <description>Instruction region</description>
                                <bitRange>[23:16]</bitRange>
                            </field>
                            <field>
                                <name>DREGION</name>
                                <description>Number of regions supported by the MPU</description>
                                <bitRange>[15:8]</bitRange>
                            </field>
                            <field>
                                <name>SEPARATE</name>
                                <description>Indicates support for separate instruction and data address maps. RAZ. ARMv6-M only supports a unified MPU</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>MPU_CTRL</name>
                        <displayName>MPU Control Register</displayName>
                        <description>Enables the MPU, and when the MPU is enabled, controls whether the default memory map is enabled as a background region for privileged accesses, and whether the MPU is enabled for HardFaults, NMIs</description>
                        <addressOffset>0x4</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>PRIVDEFENA</name>
                                <description>When the ENABLE bit is set to 1, the meaning of this bit is</description>
                                <bitRange>[2:2]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Disables the default memory map</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Enables the default memory map as a background region for privileged access</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>HFNMIENA</name>
                                <description>When the ENABLE bit is set to 1, controls whether handlers executing with priority less than 0 access memory with the MPU enabled or with the MPU disabled</description>
                                <bitRange>[1:1]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Disables the MPU for these handlers</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Use the MPU for memory accesses by these handlers</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>ENABLE</name>
                                <description>Enables the MPU</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>The MPU is disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>The MPU is enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>MPU_RNR</name>
                        <displayName>MPU Region Number Register</displayName>
                        <description>Selects the region currently accessed by MPU_RBAR and MPU_RASR</description>
                        <addressOffset>0x8</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>REGION</name>
                                <description>Indicates the memory region accessed by MPU_RBAR and MPU_RASR</description>
                                <bitRange>[7:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>MPU_RBAR</name>
                        <displayName>MPU Region Base Address Register</displayName>
                        <description>Holds the base address of the region identified by MPU_RNR</description>
                        <addressOffset>0xC</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>ADDR</name>
                                <description>Base address of the region</description>
                                <bitRange>[31:5]</bitRange>
                            </field>
                            <field>
                                <name>VALID</name>
                                <description>On writes, indicates whether the region to update is specified by MPU_RNR</description>
                                <bitRange>[4:4]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Apply the base address update to the region specified by MPU_RNR.REGION</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>
                        Update MPU_RNR.REGION to the value obtained by zero extending the
                        REGION value specified in this write
                      </description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>REGION</name>
                                <description>On writes, can specify the number of the region to update</description>
                                <bitRange>[3:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>MPU_RASR</name>
                        <displayName>MPU Region Attribute and Size Register</displayName>
                        <description>Defines the size and access behavior of the region identified by MPU_RNR, and enables that region</description>
                        <addressOffset>0x10</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>ATTRS</name>
                                <description>The MPU Region Attribute field</description>
                                <bitRange>[31:16]</bitRange>
                            </field>
                            <field>
                                <name>SRD</name>
                                <description>Subregion Disable</description>
                                <bitRange>[15:8]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Subregion enabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Subregion disabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>SIZE</name>
                                <description>Indicates the region size</description>
                                <bitRange>[5:1]</bitRange>
                            </field>
                            <field>
                                <name>ENABLE</name>
                                <description>Enables this region</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>When the MPU is enabled, this region is disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>When the MPU is enabled, this region is enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                </cluster>
