ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <cluster>
                    <name>DCB</name>
                    <description>Debug Control Block</description>
                    <addressOffset>0xEDF0</addressOffset>
                    <register>
                        <name>DHCSR</name>
                        <displayName>Debug Halting Control and Status Register</displayName>
                        <description>Controls halting debug</description>
                        <addressOffset>0x0</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>DBGKEY</name>
                                <description>Debug key</description>
                                <bitRange>[31:16]</bitRange>
                            </field>
                            <field>
                                <name>S_RESET_ST</name>
                                <description>Indicates whether the processor has been reset since the last read of DHCSR</description>
                                <bitRange>[25:25]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No reset since last DHCSR read</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>At least one reset since last DHCSR read</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>S_RETIRE_ST</name>
                                <description>Set to 1 every time the processor retires one or more instructions</description>
                                <bitRange>[24:24]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No instruction retired since last DHCSR read</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>At least one instruction retired since last DHCSR read</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>S_LOCKUP</name>
                                <description>Indicates whether the processor is locked up because of an unrecoverable exception</description>
                                <bitRange>[19:19]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Not locked up</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Locked up</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>S_SLEEP</name>
                                <description>Indicates whether the processor is sleeping</description>
                                <bitRange>[18:18]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Not sleeping</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Sleeping</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>S_HALT</name>
                                <description>Indicates whether the processor is in Debug state</description>
                                <bitRange>[17:17]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>In Non-debug state</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>In Debug state</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>S_REGRDY</name>
                                <description>A handshake flag for transfers through the DCRDR</description>
                                <bitRange>[16:16]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>There has been a write to the DCRDR, but the transfer is not complete</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>The transfer to or from the DCRDR is complete</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>C_SNAPSTALL</name>
                                <description>Allow imprecise entry to Debug state</description>
                                <bitRange>[5:5]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No action</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Allow imprecise entry to Debug state, for example by forcing any stalled load or store instruction to complete</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>C_MASKINTS</name>
                                <description>When debug is enabled, the debugger can write to this bit to mask PendSV, SysTick and external configurable interrupts</description>
                                <bitRange>[3:3]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Do not mask</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Mask PendSV, SysTick and external configurable interrupts</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>C_STEP</name>
                                <description>Processor step bit</description>
                                <bitRange>[2:2]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>No effect</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Single step enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>C_HALT</name>
                                <description>Processor halt bit</description>
                                <bitRange>[1:1]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Causes the processor to leave Debug state, if in Debug state</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Halt the processor</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>C_DEBUGEN</name>
                                <description>Halting debug enable bit</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>DCRSR</name>
                        <displayName>Debug Core Register Selector Register</displayName>
                        <description>provides debug access to the ARM core registers, special-purpose registers, and Floating-point extension regi</description>
                        <addressOffset>0x4</addressOffset>
                        <access>write-only</access>
                        <fields>
                            <field>
                                <name>REGWnR</name>
                                <description>Specifies the access type for the transfer</description>
                                <bitRange>[16:16]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Read</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Write</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>REGSEL</name>
                                <description>Specifies the ARM core register, special-purpose register, or Floating-point extension register, to transfer</description>
                                <bitRange>[6:0]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val13</name>
                                        <description>The current SP</description>
                                        <value>13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val14</name>
                                        <description>LR</description>
                                        <value>14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val15</name>
                                        <description>DebugReturnAddress</description>
                                        <value>15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val16</name>
                                        <description>xPSR</description>
                                        <value>16</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val17</name>
                                        <description>Main stack pointer, MSP</description>
                                        <value>17</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val18</name>
                                        <description>Process stack pointer, PSP</description>
                                        <value>18</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val20</name>
                                        <description>Control, Faultmask, Basepri and Primask</description>
                                        <value>20</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val33</name>
                                        <description>Floating-point Status and Control Register, FPSCR</description>
                                        <value>33</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>DCRDR</name>
                        <displayName>Debug Core Register Data Register</displayName>
                        <description>the DCRDR provides debug access to the ARM core registers, special-purpose registers, and Floating-point extensio</description>
                        <addressOffset>0x8</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>DBGTMP</name>
                                <description>Data temporary cache, for reading and writing the ARM core registers, special-purpose registers, and Floating-point extension registers</description>
                                <bitRange>[31:0]</bitRange>
                            </field>
                        </fields>
                    </register>
