ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                    <register>
                        <name>DEMCR</name>
                        <displayName>Debug Exception and Monitor Control Register</displayName>
                        <description>Manages vector catch behavior and DebugMonitor handling when debugging</description>
                        <addressOffset>0xC</addressOffset>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>TRCENA</name>
                                <description>Global enable for all DWT and ITM features</description>
                                <bitRange>[24:24]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>DWT and ITM units disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>DWT and ITM units enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>MON_REQ</name>
                                <description>DebugMonitor semaphore bit</description>
                                <bitRange>[19:19]</bitRange>
                            </field>
                            <field>
                                <name>MON_STEP</name>
                                <description>When MON_EN is set to 0, this feature is disabled and the processor ignores MON_STEP</description>
                                <bitRange>[18:18]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Do not step the processor</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Step the processor</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>MON_PEND</name>
                                <description>Sets or clears the pending state of the DebugMonitor exception</description>
                                <bitRange>[17:17]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Clear the status of the DebugMonitor exception to not pending</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Set the status of the DebugMonitor exception to pending</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>MON_EN</name>
                                <description>Enable the DebugMonitor exception</description>
                                <bitRange>[16:16]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>DebugMonitor exception disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>DebugMonitor exception enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VC_HARDERR</name>
                                <description>Enable halting debug trap on a HardFault exception</description>
                                <bitRange>[10:10]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Halting debug trap disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Halting debug trap enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VC_INTERR</name>
                                <description>Enable halting debug trap on a fault occurring during exception entry or exception return</description>
                                <bitRange>[9:9]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Halting debug trap disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Halting debug trap enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VC_BUSERR</name>
                                <description>Enable halting debug trap on a BusFault exception</description>
                                <bitRange>[8:8]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Halting debug trap disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Halting debug trap enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VC_STATERR</name>
                                <description>Enable halting debug trap on a UsageFault exception caused by a state information error, for example an Undefined Instruction exception</description>
                                <bitRange>[7:7]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Halting debug trap disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Halting debug trap enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VC_CHKERR</name>
                                <description>Enable halting debug trap on a UsageFault exception caused by a checking error, for example an alignment check error</description>
                                <bitRange>[6:6]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Halting debug trap disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Halting debug trap enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VC_NOCPERR</name>
                                <description>Enable halting debug trap on a UsageFault caused by an access to a Coprocessor</description>
                                <bitRange>[5:5]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Halting debug trap disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Halting debug trap enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VC_MMERR</name>
                                <description>Enable halting debug trap on a MemManage exception</description>
                                <bitRange>[4:4]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Halting debug trap disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Halting debug trap enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>VC_CORERESET</name>
                                <description>Enable Reset Vector Catch</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>val0</name>
                                        <description>Reset Vector Catch disabled</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>val1</name>
                                        <description>Reset Vector Catch enabled</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                </cluster>
