ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>SSI</name>
            <description>DW_apb_ssi has the following features: 
            * APB interface – Allows for easy integration into a DesignWare Synthesizable Components for AMBA 2 implementation. 
            * APB3 and APB4 protocol support. 
            * Scalable APB data bus width – Supports APB data bus widths of 8, 16, and 32 bits. 
            * Serial-master or serial-slave operation – Enables serial communication with serial-master or serial-slave peripheral devices. 
            * Programmable Dual/Quad/Octal SPI support in Master Mode. 
            * Dual Data Rate (DDR) and Read Data Strobe (RDS) Support - Enables the DW_apb_ssi master to perform operations with the device in DDR and RDS modes when working in Dual/Quad/Octal mode of operation. 
            * Data Mask Support - Enables the DW_apb_ssi to selectively update the bytes in the device. This feature is applicable only in enhanced SPI modes. 
            * eXecute-In-Place (XIP) support - Enables the DW_apb_ssi master to behave as a memory mapped I/O and fetches the data from the device based on the APB read request. This feature is applicable only in enhanced SPI modes. 
            * DMA Controller Interface – Enables the DW_apb_ssi to interface to a DMA controller over the bus using a handshaking interface for transfer requests. 
            * Independent masking of interrupts – Master collision, transmit FIFO overflow, transmit FIFO empty, receive FIFO full, receive FIFO underflow, and receive FIFO overflow interrupts can all be masked independently. 
            * Multi-master contention detection – Informs the processor of multiple serial-master accesses on the serial bus. 
            * Bypass of meta-stability flip-flops for synchronous clocks – When the APB clock (pclk) and the DW_apb_ssi serial clock (ssi_clk) are synchronous, meta-stable flip-flops are not used when transferring control signals across these clock domains. 
            * Programmable delay on the sample time of the received serial data bit (rxd); enables programmable control of routing delays resulting in higher serial data-bit rates. 
            * Programmable features: 
            - Serial interface operation – Choice of Motorola SPI, Texas Instruments Synchronous Serial Protocol or National Semiconductor Microwire. 
            - Clock bit-rate – Dynamic control of the serial bit rate of the data transfer; used in only serial-master mode of operation. 
            - Data Item size (4 to 32 bits) – Item size of each data transfer under the control of the programmer. 
            * Configured features: 
            - FIFO depth – 16 words deep. The FIFO width is fixed at 32 bits. 
            - 1 slave select output. 
            - Hardware slave-select – Dedicated hardware slave-select line. 
            - Combined interrupt line - one combined interrupt line from the DW_apb_ssi to the interrupt controller. 
            - Interrupt polarity – active high interrupt lines. 
            - Serial clock polarity – low serial-clock polarity directly after reset. 
            - Serial clock phase – capture on first edge of serial-clock directly after reset.</description>
            <baseAddress>0x18000000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>252</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRLR0</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Control register 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SSTE</name>
                            <description>Slave select toggle enable</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI_FRF</name>
                            <description>SPI frame format</description>
                            <bitRange>[22:21]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STD</name>
                                    <value>0</value>
                                    <description>Standard 1-bit SPI frame format; 1 bit per SCK, full-duplex</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DUAL</name>
                                    <value>1</value>
                                    <description>Dual-SPI frame format; two bits per SCK, half-duplex</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>QUAD</name>
                                    <value>2</value>
                                    <description>Quad-SPI frame format; four bits per SCK, half-duplex</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DFS_32</name>
                            <description>Data frame size in 32b transfer mode 
                            Value of n -&gt; n+1 clocks per frame.</description>
                            <bitRange>[20:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFS</name>
                            <description>Control frame size 
                            Value of n -&gt; n+1 clocks per frame.</description>
                            <bitRange>[15:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRL</name>
                            <description>Shift register loop (test mode)</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLV_OE</name>
                            <description>Slave output enable</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMOD</name>
                            <description>Transfer mode</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TX_AND_RX</name>
                                    <value>0</value>
                                    <description>Both transmit and receive</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TX_ONLY</name>
                                    <value>1</value>
                                    <description>Transmit only (not for FRF == 0, standard SPI mode)</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RX_ONLY</name>
                                    <value>2</value>
                                    <description>Receive only (not for FRF == 0, standard SPI mode)</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EEPROM_READ</name>
                                    <value>3</value>
                                    <description>EEPROM read mode (TX then RX; RX starts after control data TX'd)</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SCPOL</name>
                            <description>Serial clock polarity</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCPH</name>
                            <description>Serial clock phase</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRF</name>
                            <description>Frame format</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DFS</name>
                            <description>Data frame size</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRLR1</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Master Control register 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NDF</name>
                            <description>Number of data frames</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSIENR</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>SSI Enable</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SSI_EN</name>
                            <description>SSI enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MWCR</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>Microwire Control</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MHS</name>
                            <description>Microwire handshaking</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MDD</name>
                            <description>Microwire control</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MWMOD</name>
                            <description>Microwire transfer mode</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SER</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>Slave enable</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SER</name>
                            <description>For each bit: 
                            0 -&gt; slave not selected 
                            1 -&gt; slave selected</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BAUDR</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>Baud rate</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCKDV</name>
                            <description>SSI clock divider</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXFTLR</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>TX FIFO threshold level</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TFT</name>
                            <description>Transmit FIFO threshold</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXFTLR</name>
                    <addressOffset>0x0000001c</addressOffset>
                    <description>RX FIFO threshold level</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFT</name>
                            <description>Receive FIFO threshold</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXFLR</name>
                    <addressOffset>0x00000020</addressOffset>
                    <description>TX FIFO level</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TFTFL</name>
                            <description>Transmit FIFO level</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXFLR</name>
                    <addressOffset>0x00000024</addressOffset>
                    <description>RX FIFO level</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXTFL</name>
                            <description>Receive FIFO level</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <addressOffset>0x00000028</addressOffset>
                    <description>Status register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DCOL</name>
                            <description>Data collision error</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXE</name>
                            <description>Transmission error</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFF</name>
                            <description>Receive FIFO full</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFNE</name>
                            <description>Receive FIFO not empty</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFNF</name>
                            <description>Transmit FIFO not full</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>SSI busy flag</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IMR</name>
                    <addressOffset>0x0000002c</addressOffset>
                    <description>Interrupt mask</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MSTIM</name>
                            <description>Multi-master contention interrupt mask</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFIM</name>
                            <description>Receive FIFO full interrupt mask</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXOIM</name>
                            <description>Receive FIFO overflow interrupt mask</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXUIM</name>
                            <description>Receive FIFO underflow interrupt mask</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXOIM</name>
                            <description>Transmit FIFO overflow interrupt mask</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXEIM</name>
                            <description>Transmit FIFO empty interrupt mask</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISR</name>
                    <addressOffset>0x00000030</addressOffset>
                    <description>Interrupt status</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MSTIS</name>
                            <description>Multi-master contention interrupt status</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXFIS</name>
                            <description>Receive FIFO full interrupt status</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXOIS</name>
                            <description>Receive FIFO overflow interrupt status</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXUIS</name>
                            <description>Receive FIFO underflow interrupt status</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXOIS</name>
                            <description>Transmit FIFO overflow interrupt status</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXEIS</name>
                            <description>Transmit FIFO empty interrupt status</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
