ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>RISR</name>
                    <addressOffset>0x00000034</addressOffset>
                    <description>Raw interrupt status</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MSTIR</name>
                            <description>Multi-master contention raw interrupt status</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXFIR</name>
                            <description>Receive FIFO full raw interrupt status</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXOIR</name>
                            <description>Receive FIFO overflow raw interrupt status</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXUIR</name>
                            <description>Receive FIFO underflow raw interrupt status</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXOIR</name>
                            <description>Transmit FIFO overflow raw interrupt status</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXEIR</name>
                            <description>Transmit FIFO empty raw interrupt status</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXOICR</name>
                    <addressOffset>0x00000038</addressOffset>
                    <description>TX FIFO overflow interrupt clear</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXOICR</name>
                            <description>Clear-on-read transmit FIFO overflow interrupt</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXOICR</name>
                    <addressOffset>0x0000003c</addressOffset>
                    <description>RX FIFO overflow interrupt clear</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXOICR</name>
                            <description>Clear-on-read receive FIFO overflow interrupt</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXUICR</name>
                    <addressOffset>0x00000040</addressOffset>
                    <description>RX FIFO underflow interrupt clear</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXUICR</name>
                            <description>Clear-on-read receive FIFO underflow interrupt</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSTICR</name>
                    <addressOffset>0x00000044</addressOffset>
                    <description>Multi-master interrupt clear</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MSTICR</name>
                            <description>Clear-on-read multi-master contention interrupt</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICR</name>
                    <addressOffset>0x00000048</addressOffset>
                    <description>Interrupt clear</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ICR</name>
                            <description>Clear-on-read all active interrupts</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACR</name>
                    <addressOffset>0x0000004c</addressOffset>
                    <description>DMA control</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TDMAE</name>
                            <description>Transmit DMA enable</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDMAE</name>
                            <description>Receive DMA enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMATDLR</name>
                    <addressOffset>0x00000050</addressOffset>
                    <description>DMA TX data level</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMATDL</name>
                            <description>Transmit data watermark level</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMARDLR</name>
                    <addressOffset>0x00000054</addressOffset>
                    <description>DMA RX data level</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMARDL</name>
                            <description>Receive data watermark level (DMARDLR+1)</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDR</name>
                    <addressOffset>0x00000058</addressOffset>
                    <description>Identification register</description>
                    <resetValue>0x51535049</resetValue>
                    <fields>
                        <field>
                            <name>IDCODE</name>
                            <description>Peripheral dentification code</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSI_VERSION_ID</name>
                    <addressOffset>0x0000005c</addressOffset>
                    <description>Version ID</description>
                    <resetValue>0x3430312a</resetValue>
                    <fields>
                        <field>
                            <name>SSI_COMP_VERSION</name>
                            <description>SNPS component version (format X.YY)</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR0</name>
                    <addressOffset>0x00000060</addressOffset>
                    <description>Data Register 0 (of 36)</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DR</name>
                            <description>First data register of 36</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RX_SAMPLE_DLY</name>
                    <addressOffset>0x000000f0</addressOffset>
                    <description>RX sample delay</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSD</name>
                            <description>RXD sample delay (in SCLK cycles)</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_CTRLR0</name>
                    <addressOffset>0x000000f4</addressOffset>
                    <description>SPI control</description>
                    <resetValue>0x03000000</resetValue>
                    <fields>
                        <field>
                            <name>XIP_CMD</name>
                            <description>SPI Command to send in XIP mode (INST_L = 8-bit) or to append to Address (INST_L = 0-bit)</description>
                            <bitRange>[31:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI_RXDS_EN</name>
                            <description>Read data strobe enable</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INST_DDR_EN</name>
                            <description>Instruction DDR transfer enable</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI_DDR_EN</name>
                            <description>SPI DDR transfer enable</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WAIT_CYCLES</name>
                            <description>Wait cycles between control frame transmit and data reception (in SCLK cycles)</description>
                            <bitRange>[15:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INST_L</name>
                            <description>Instruction length (0/4/8/16b)</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NONE</name>
                                    <value>0</value>
                                    <description>No instruction</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4B</name>
                                    <value>1</value>
                                    <description>4-bit instruction</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8B</name>
                                    <value>2</value>
                                    <description>8-bit instruction</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16B</name>
                                    <value>3</value>
                                    <description>16-bit instruction</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADDR_L</name>
                            <description>Address length (0b-60b in 4b increments)</description>
                            <bitRange>[5:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRANS_TYPE</name>
                            <description>Address and instruction transfer format</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1C1A</name>
                                    <value>0</value>
                                    <description>Command and address both in standard SPI frame format</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1C2A</name>
                                    <value>1</value>
                                    <description>Command in standard SPI format, address in format specified by FRF</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2C2A</name>
                                    <value>2</value>
                                    <description>Command and address both in format specified by FRF (e.g. Dual-SPI)</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXD_DRIVE_EDGE</name>
                    <addressOffset>0x000000f8</addressOffset>
                    <description>TX drive edge</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TDE</name>
                            <description>TXD drive edge</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
