ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>XIP_CTRL</name>
            <description>QSPI flash execute-in-place block</description>
            <baseAddress>0x14000000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>XIP_IRQ</name>
                <value>6</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Cache control</description>
                    <resetValue>0x00000003</resetValue>
                    <fields>
                        <field>
                            <name>POWER_DOWN</name>
                            <description>When 1, the cache memories are powered down. They retain state, 
                            but can not be accessed. This reduces static power dissipation. 
                            Writing 1 to this bit forces CTRL_EN to 0, i.e. the cache cannot 
                            be enabled when powered down. 
                            Cache-as-SRAM accesses will produce a bus error response when 
                            the cache is powered down.</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERR_BADWRITE</name>
                            <description>When 1, writes to any alias other than 0x0 (caching, allocating) 
                            will produce a bus fault. When 0, these writes are silently ignored. 
                            In either case, writes to the 0x0 alias will deallocate on tag match, 
                            as usual.</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>When 1, enable the cache. When the cache is disabled, all XIP accesses 
                            will go straight to the flash, without querying the cache. When enabled, 
                            cacheable XIP accesses will query the cache, and the flash will 
                            not be accessed if the tag matches and the valid bit is set.

                            If the cache is enabled, cache-as-SRAM accesses have no effect on the 
                            cache data RAM, and will produce a bus error response.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLUSH</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Cache Flush control</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FLUSH</name>
                            <description>Write 1 to flush the cache. This clears the tag memory, but 
                            the data memory retains its contents. (This means cache-as-SRAM 
                            contents is not affected by flush or reset.) 
                            Reading will hold the bus (stall the processor) until the flush 
                            completes. Alternatively STAT can be polled until completion.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>Cache Status</description>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <field>
                            <name>FIFO_FULL</name>
                            <description>When 1, indicates the XIP streaming FIFO is completely full. 
                            The streaming FIFO is 2 entries deep, so the full and empty 
                            flag allow its level to be ascertained.</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FIFO_EMPTY</name>
                            <description>When 1, indicates the XIP streaming FIFO is completely empty.</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLUSH_READY</name>
                            <description>Reads as 0 while a cache flush is in progress, and 1 otherwise. 
                            The cache is flushed whenever the XIP block is reset, and also 
                            when requested via the FLUSH register.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTR_HIT</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>Cache Hit counter</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTR_HIT</name>
                            <description>A 32 bit saturating counter that increments upon each cache hit, 
                            i.e. when an XIP access is serviced directly from cached data. 
                            Write any value to clear.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTR_ACC</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>Cache Access counter</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTR_ACC</name>
                            <description>A 32 bit saturating counter that increments upon each XIP access, 
                            whether the cache is hit or not. This includes noncacheable accesses. 
                            Write any value to clear.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STREAM_ADDR</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>FIFO stream address</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STREAM_ADDR</name>
                            <description>The address of the next word to be streamed from flash to the streaming FIFO. 
                            Increments automatically after each flash access. 
                            Write the initial access address here before starting a streaming read.</description>
                            <bitRange>[31:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STREAM_CTR</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>FIFO stream control</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STREAM_CTR</name>
                            <description>Write a nonzero value to start a streaming read. This will then 
                            progress in the background, using flash idle cycles to transfer 
                            a linear data block from flash to the streaming FIFO. 
                            Decrements automatically (1 at a time) as the stream 
                            progresses, and halts on reaching 0. 
                            Write 0 to halt an in-progress stream, and discard any in-flight 
                            read, so that a new stream can immediately be started (after 
                            draining the FIFO and reinitialising STREAM_ADDR)</description>
                            <bitRange>[21:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STREAM_FIFO</name>
                    <addressOffset>0x0000001c</addressOffset>
                    <description>FIFO stream data</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STREAM_FIFO</name>
                            <description>Streamed data is buffered here, for retrieval by the system DMA. 
                            This FIFO can also be accessed via the XIP_AUX slave, to avoid exposing 
                            the DMA to bus stalls caused by other XIP traffic.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
