ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>SYSCFG</name>
            <description>Register block for various chip control signals</description>
            <baseAddress>0x40004000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PROC0_NMI_MASK</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Processor core 0 NMI source mask</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PROC0_NMI_MASK</name>
                            <description>Set a bit high to enable NMI from that IRQ</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PROC1_NMI_MASK</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Processor core 1 NMI source mask</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PROC1_NMI_MASK</name>
                            <description>Set a bit high to enable NMI from that IRQ</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PROC_CONFIG</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>Configuration for processors</description>
                    <resetValue>0x10000000</resetValue>
                    <fields>
                        <field>
                            <name>PROC1_DAP_INSTID</name>
                            <description>Configure proc1 DAP instance ID. 
                            Recommend that this is NOT changed until you require debug access in multi-chip environment 
                            WARNING: do not set to 15 as this is reserved for RescueDP</description>
                            <bitRange>[31:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC0_DAP_INSTID</name>
                            <description>Configure proc0 DAP instance ID. 
                            Recommend that this is NOT changed until you require debug access in multi-chip environment 
                            WARNING: do not set to 15 as this is reserved for RescueDP</description>
                            <bitRange>[27:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC1_HALTED</name>
                            <description>Indication that proc1 has halted</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PROC0_HALTED</name>
                            <description>Indication that proc0 has halted</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PROC_IN_SYNC_BYPASS</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>For each bit, if 1, bypass the input synchronizer between that GPIO 
                    and the GPIO input register in the SIO. The input synchronizers should 
                    generally be unbypassed, to avoid injecting metastabilities into processors. 
                    If you're feeling brave, you can bypass to save two cycles of input 
                    latency. This register applies to GPIO 0...29.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PROC_IN_SYNC_BYPASS</name>
                            <bitRange>[29:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PROC_IN_SYNC_BYPASS_HI</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>For each bit, if 1, bypass the input synchronizer between that GPIO 
                    and the GPIO input register in the SIO. The input synchronizers should 
                    generally be unbypassed, to avoid injecting metastabilities into processors. 
                    If you're feeling brave, you can bypass to save two cycles of input 
                    latency. This register applies to GPIO 30...35 (the QSPI IOs).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PROC_IN_SYNC_BYPASS_HI</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DBGFORCE</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>Directly control the SWD debug port of either processor</description>
                    <resetValue>0x00000066</resetValue>
                    <fields>
                        <field>
                            <name>PROC1_ATTACH</name>
                            <description>Attach processor 1 debug port to syscfg controls, and disconnect it from external SWD pads.</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC1_SWCLK</name>
                            <description>Directly drive processor 1 SWCLK, if PROC1_ATTACH is set</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC1_SWDI</name>
                            <description>Directly drive processor 1 SWDIO input, if PROC1_ATTACH is set</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC1_SWDO</name>
                            <description>Observe the value of processor 1 SWDIO output.</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PROC0_ATTACH</name>
                            <description>Attach processor 0 debug port to syscfg controls, and disconnect it from external SWD pads.</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC0_SWCLK</name>
                            <description>Directly drive processor 0 SWCLK, if PROC0_ATTACH is set</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC0_SWDI</name>
                            <description>Directly drive processor 0 SWDIO input, if PROC0_ATTACH is set</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC0_SWDO</name>
                            <description>Observe the value of processor 0 SWDIO output.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MEMPOWERDOWN</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>Control power downs to memories. Set high to power down memories. 
                    Use with extreme caution</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ROM</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USB</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM5</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM4</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM3</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM2</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM0</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
