ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>XOSC</name>
            <description>Controls the crystal oscillator</description>
            <baseAddress>0x40024000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Crystal Oscillator Control</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>On power-up this field is initialised to DISABLE and the chip runs from the ROSC. 
                            If the chip has subsequently been programmed to run from the XOSC then DISABLE may lock-up the chip. If this is a concern then run the clk_ref from the ROSC and enable the clk_sys RESUS feature. 
                            The 12-bit code is intended to give some protection against accidental writes. An invalid setting will enable the oscillator.</description>
                            <bitRange>[23:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <value>3358</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <value>4011</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FREQ_RANGE</name>
                            <description>Frequency range. An invalid setting will retain the previous value. The actual value being used can be read from STATUS_FREQ_RANGE. This resets to 0xAA0 and cannot be changed.</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1_15MHZ</name>
                                    <value>2720</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED_1</name>
                                    <value>2721</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED_2</name>
                                    <value>2722</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED_3</name>
                                    <value>2723</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATUS</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Crystal Oscillator Status</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STABLE</name>
                            <description>Oscillator is running and stable</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BADWRITE</name>
                            <description>An invalid value has been written to CTRL_ENABLE or CTRL_FREQ_RANGE or DORMANT</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>ENABLED</name>
                            <description>Oscillator is enabled but not necessarily running and stable, resets to 0</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FREQ_RANGE</name>
                            <description>The current frequency range setting, always reads 0</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1_15MHZ</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED_1</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED_2</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED_3</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DORMANT</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>Crystal Oscillator pause control</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>DORMANT</name>
                            <description>This is used to save power by pausing the XOSC 
                            On power-up this field is initialised to WAKE 
                            An invalid write will also select WAKE 
                            Warning: stop the PLLs before selecting dormant mode 
                            Warning: setup the irq before selecting dormant mode</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>dormant</name>
                                    <value>1668246881</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WAKE</name>
                                    <value>2002873189</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STARTUP</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>Controls the startup delay</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>X4</name>
                            <description>Multiplies the startup_delay by 4. This is of little value to the user given that the delay can be programmed directly.</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DELAY</name>
                            <description>in multiples of 256*xtal_period. The reset value of 0xc4 corresponds to approx 50 000 cycles.</description>
                            <bitRange>[13:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COUNT</name>
                    <addressOffset>0x0000001c</addressOffset>
                    <description>A down counter running at the xosc frequency which counts to zero and stops. 
                    To start the counter write a non-zero value. 
                    Can be used for short software pauses when setting up time sensitive hardware.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>COUNT</name>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
