ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>WATCHDOG</name>
            <baseAddress>0x40058000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Watchdog control 
                    The rst_wdsel register determines which subsystems are reset when the watchdog is triggered. 
                    The watchdog can be triggered in software.</description>
                    <resetValue>0x07000000</resetValue>
                    <fields>
                        <field>
                            <name>TRIGGER</name>
                            <description>Trigger a watchdog reset</description>
                            <bitRange>[31:31]</bitRange>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>When not enabled the watchdog timer is paused</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAUSE_DBG1</name>
                            <description>Pause the watchdog timer when processor 1 is in debug mode</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAUSE_DBG0</name>
                            <description>Pause the watchdog timer when processor 0 is in debug mode</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAUSE_JTAG</name>
                            <description>Pause the watchdog timer when JTAG is accessing the bus fabric</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIME</name>
                            <description>Indicates the number of ticks / 2 (see errata RP2040-E1) before a watchdog reset will be triggered</description>
                            <bitRange>[23:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOAD</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Load the watchdog timer. The maximum setting is 0xffffff which corresponds to 0xffffff / 2 ticks before triggering a watchdog reset (see errata RP2040-E1).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LOAD</name>
                            <bitRange>[23:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REASON</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>Logs the reason for the last reset. Both bits are zero for the case of a hardware reset.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FORCE</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TIMER</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRATCH0</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>Scratch register. Information persists through soft reset of the chip.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCRATCH0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRATCH1</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>Scratch register. Information persists through soft reset of the chip.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCRATCH1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRATCH2</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>Scratch register. Information persists through soft reset of the chip.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCRATCH2</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRATCH3</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>Scratch register. Information persists through soft reset of the chip.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCRATCH3</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRATCH4</name>
                    <addressOffset>0x0000001c</addressOffset>
                    <description>Scratch register. Information persists through soft reset of the chip.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCRATCH4</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRATCH5</name>
                    <addressOffset>0x00000020</addressOffset>
                    <description>Scratch register. Information persists through soft reset of the chip.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCRATCH5</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRATCH6</name>
                    <addressOffset>0x00000024</addressOffset>
                    <description>Scratch register. Information persists through soft reset of the chip.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCRATCH6</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRATCH7</name>
                    <addressOffset>0x00000028</addressOffset>
                    <description>Scratch register. Information persists through soft reset of the chip.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCRATCH7</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TICK</name>
                    <addressOffset>0x0000002c</addressOffset>
                    <description>Controls the tick generator</description>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>COUNT</name>
                            <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                            <bitRange>[19:11]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RUNNING</name>
                            <description>Is the tick generator running?</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>start / stop tick generation</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CYCLES</name>
                            <description>Total number of clk_tick cycles before the next tick.</description>
                            <bitRange>[8:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
