ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            This only affects the order in which the DMA schedules channels. The DMA's bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput.</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>DMA Channel Enable. 
                            When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high)</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL1_CTRL</name>
                    <addressOffset>0x00000090</addressOffset>
                    <description>Alias for channel 2 CTRL register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL1_CTRL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL1_READ_ADDR</name>
                    <addressOffset>0x00000094</addressOffset>
                    <description>Alias for channel 2 READ_ADDR register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL1_READ_ADDR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL1_WRITE_ADDR</name>
                    <addressOffset>0x00000098</addressOffset>
                    <description>Alias for channel 2 WRITE_ADDR register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL1_WRITE_ADDR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL1_TRANS_COUNT_TRIG</name>
                    <addressOffset>0x0000009c</addressOffset>
                    <description>Alias for channel 2 TRANS_COUNT register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL1_TRANS_COUNT_TRIG</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL2_CTRL</name>
                    <addressOffset>0x000000a0</addressOffset>
                    <description>Alias for channel 2 CTRL register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL2_CTRL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL2_TRANS_COUNT</name>
                    <addressOffset>0x000000a4</addressOffset>
                    <description>Alias for channel 2 TRANS_COUNT register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL2_TRANS_COUNT</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL2_READ_ADDR</name>
                    <addressOffset>0x000000a8</addressOffset>
                    <description>Alias for channel 2 READ_ADDR register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL2_READ_ADDR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL2_WRITE_ADDR_TRIG</name>
                    <addressOffset>0x000000ac</addressOffset>
                    <description>Alias for channel 2 WRITE_ADDR register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL2_WRITE_ADDR_TRIG</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL3_CTRL</name>
                    <addressOffset>0x000000b0</addressOffset>
                    <description>Alias for channel 2 CTRL register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL3_CTRL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL3_WRITE_ADDR</name>
                    <addressOffset>0x000000b4</addressOffset>
                    <description>Alias for channel 2 WRITE_ADDR register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL3_WRITE_ADDR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL3_TRANS_COUNT</name>
                    <addressOffset>0x000000b8</addressOffset>
                    <description>Alias for channel 2 TRANS_COUNT register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL3_TRANS_COUNT</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_AL3_READ_ADDR_TRIG</name>
                    <addressOffset>0x000000bc</addressOffset>
                    <description>Alias for channel 2 READ_ADDR register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH2_AL3_READ_ADDR_TRIG</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3_READ_ADDR</name>
                    <addressOffset>0x000000c0</addressOffset>
                    <description>DMA Channel 3 Read Address pointer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH3_READ_ADDR</name>
                            <description>This register updates automatically each time a read completes. The current value is the next address to be read by this channel.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3_WRITE_ADDR</name>
                    <addressOffset>0x000000c4</addressOffset>
                    <description>DMA Channel 3 Write Address pointer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH3_WRITE_ADDR</name>
                            <description>This register updates automatically each time a write completes. The current value is the next address to be written by this channel.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3_TRANS_COUNT</name>
                    <addressOffset>0x000000c8</addressOffset>
                    <description>DMA Channel 3 Transfer Count</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH3_TRANS_COUNT</name>
                            <description>Program the number of bus transfers a channel will perform before halting. Note that, if transfers are larger than one byte in size, this is not equal to the number of bytes transferred (see CTRL_DATA_SIZE).

                            When the channel is active, reading this register shows the number of transfers remaining, updating automatically each time a write transfer completes.

                            Writing this register sets the RELOAD value for the transfer counter. Each time this channel is triggered, the RELOAD value is copied into the live transfer counter. The channel can be started multiple times, and will perform the same number of transfers each time, as programmed by most recent write.

                            The RELOAD value can be observed at CHx_DBG_TCR. If TRANS_COUNT is used as a trigger, the written value is used immediately as the length of the new transfer sequence, as well as being written to RELOAD.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3_CTRL_TRIG</name>
                    <addressOffset>0x000000cc</addressOffset>
                    <description>DMA Channel 3 Control and Status</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AHB_ERROR</name>
                            <description>Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel halts when it encounters any bus error, and always raises its channel IRQ flag.</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>READ_ERROR</name>
                            <description>If 1, the channel received a read bus error. Write one to clear. 
                            READ_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 3 transfers later)</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>WRITE_ERROR</name>
                            <description>If 1, the channel received a write bus error. Write one to clear. 
                            WRITE_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 5 transfers later)</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>This flag goes high when the channel starts a new transfer sequence, and low when the last transfer of that sequence completes. Clearing EN while BUSY is high pauses the channel, and BUSY will stay high while paused.

                            To terminate a sequence early (and clear the BUSY flag), see CHAN_ABORT.</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SNIFF_EN</name>
                            <description>If 1, this channel's data transfers are visible to the sniff hardware, and each transfer will advance the state of the checksum. This only applies if the sniff hardware is enabled, and has this channel selected.

