ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            This allows checksum to be enabled or disabled on a per-control- block basis.</description>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BSWAP</name>
                            <description>Apply byte-swap transformation to DMA data. 
                            For byte data, this has no effect. For halfword data, the two bytes of each halfword are swapped. For word data, the four bytes of each word are swapped to reverse order.</description>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRQ_QUIET</name>
                            <description>In QUIET mode, the channel does not generate IRQs at the end of every transfer block. Instead, an IRQ is raised when NULL is written to a trigger register, indicating the end of a control block chain.

                            This reduces the number of interrupts to be serviced by the CPU when transferring a DMA chain of many small control blocks.</description>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TREQ_SEL</name>
                            <description>Select a Transfer Request signal. 
                            The channel uses the transfer request signal to pace its data transfer rate. Sources for TREQ signals are internal (TIMERS) or external (DREQ, a Data Request from the system). 
                            0x0 to 0x3a -&gt; select DREQ n as TREQ</description>
                            <bitRange>[20:15]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PIO0_TX0</name>
                                    <value>0</value>
                                    <description>Select PIO0's TX FIFO 0 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO0_TX1</name>
                                    <value>1</value>
                                    <description>Select PIO0's TX FIFO 1 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO0_TX2</name>
                                    <value>2</value>
                                    <description>Select PIO0's TX FIFO 2 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO0_TX3</name>
                                    <value>3</value>
                                    <description>Select PIO0's TX FIFO 3 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO0_RX0</name>
                                    <value>4</value>
                                    <description>Select PIO0's RX FIFO 0 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO0_RX1</name>
                                    <value>5</value>
                                    <description>Select PIO0's RX FIFO 1 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO0_RX2</name>
                                    <value>6</value>
                                    <description>Select PIO0's RX FIFO 2 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO0_RX3</name>
                                    <value>7</value>
                                    <description>Select PIO0's RX FIFO 3 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO1_TX0</name>
                                    <value>8</value>
                                    <description>Select PIO1's TX FIFO 0 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO1_TX1</name>
                                    <value>9</value>
                                    <description>Select PIO1's TX FIFO 1 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO1_TX2</name>
                                    <value>10</value>
                                    <description>Select PIO1's TX FIFO 2 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO1_TX3</name>
                                    <value>11</value>
                                    <description>Select PIO1's TX FIFO 3 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO1_RX0</name>
                                    <value>12</value>
                                    <description>Select PIO1's RX FIFO 0 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO1_RX1</name>
                                    <value>13</value>
                                    <description>Select PIO1's RX FIFO 1 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO1_RX2</name>
                                    <value>14</value>
                                    <description>Select PIO1's RX FIFO 2 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PIO1_RX3</name>
                                    <value>15</value>
                                    <description>Select PIO1's RX FIFO 3 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI0_TX</name>
                                    <value>16</value>
                                    <description>Select SPI0's TX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI0_RX</name>
                                    <value>17</value>
                                    <description>Select SPI0's RX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI1_TX</name>
                                    <value>18</value>
                                    <description>Select SPI1's TX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI1_RX</name>
                                    <value>19</value>
                                    <description>Select SPI1's RX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART0_TX</name>
                                    <value>20</value>
                                    <description>Select UART0's TX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART0_RX</name>
                                    <value>21</value>
                                    <description>Select UART0's RX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART1_TX</name>
                                    <value>22</value>
                                    <description>Select UART1's TX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART1_RX</name>
                                    <value>23</value>
                                    <description>Select UART1's RX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWM_WRAP0</name>
                                    <value>24</value>
                                    <description>Select PWM Counter 0's Wrap Value as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWM_WRAP1</name>
                                    <value>25</value>
                                    <description>Select PWM Counter 1's Wrap Value as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWM_WRAP2</name>
                                    <value>26</value>
                                    <description>Select PWM Counter 2's Wrap Value as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWM_WRAP3</name>
                                    <value>27</value>
                                    <description>Select PWM Counter 3's Wrap Value as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWM_WRAP4</name>
                                    <value>28</value>
                                    <description>Select PWM Counter 4's Wrap Value as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWM_WRAP5</name>
                                    <value>29</value>
                                    <description>Select PWM Counter 5's Wrap Value as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWM_WRAP6</name>
                                    <value>30</value>
                                    <description>Select PWM Counter 6's Wrap Value as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWM_WRAP7</name>
                                    <value>31</value>
                                    <description>Select PWM Counter 7's Wrap Value as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2C0_TX</name>
                                    <value>32</value>
                                    <description>Select I2C0's TX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2C0_RX</name>
                                    <value>33</value>
                                    <description>Select I2C0's RX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2C1_TX</name>
                                    <value>34</value>
                                    <description>Select I2C1's TX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2C1_RX</name>
                                    <value>35</value>
                                    <description>Select I2C1's RX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADC</name>
                                    <value>36</value>
                                    <description>Select the ADC as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XIP_STREAM</name>
                                    <value>37</value>
                                    <description>Select the XIP Streaming FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XIP_SSITX</name>
                                    <value>38</value>
                                    <description>Select the XIP SSI TX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XIP_SSIRX</name>
                                    <value>39</value>
                                    <description>Select the XIP SSI RX FIFO as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIMER0</name>
                                    <value>59</value>
                                    <description>Select Timer 0 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIMER1</name>
                                    <value>60</value>
                                    <description>Select Timer 1 as TREQ</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIMER2</name>
                                    <value>61</value>
                                    <description>Select Timer 2 as TREQ (Optional)</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIMER3</name>
                                    <value>62</value>
                                    <description>Select Timer 3 as TREQ (Optional)</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PERMANENT</name>
                                    <value>63</value>
                                    <description>Permanent request, for unpaced transfers.</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CHAIN_TO</name>
                            <description>When this channel completes, it will trigger the channel indicated by CHAIN_TO. Disable by setting CHAIN_TO = _(this channel)_.</description>
                            <bitRange>[14:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RING_SEL</name>
                            <description>Select whether RING_SIZE applies to read or write addresses. 
                            If 0, read addresses are wrapped on a (1 &lt;&lt; RING_SIZE) boundary. If 1, write addresses are wrapped.</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RING_SIZE</name>
                            <description>Size of address wrap region. If 0, don't wrap. For values n &gt; 0, only the lower n bits of the address will change. This wraps the address on a (1 &lt;&lt; n) byte boundary, facilitating access to naturally-aligned ring buffers.

                            Ring sizes between 2 and 32768 bytes are possible. This can apply to either read or write addresses, based on value of RING_SEL.</description>
                            <bitRange>[9:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RING_NONE</name>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INCR_WRITE</name>
                            <description>If 1, the write address increments with each transfer. If 0, each write is directed to the same, initial address.

                            Generally this should be disabled for memory-to-peripheral transfers.</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INCR_READ</name>
                            <description>If 1, the read address increments with each transfer. If 0, each read is directed to the same, initial address.

                            Generally this should be disabled for peripheral-to-memory transfers.</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA_SIZE</name>
                            <description>Set the size of each bus transfer (byte/halfword/word). READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes) with each transfer.</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SIZE_BYTE</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SIZE_HALFWORD</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SIZE_WORD</name>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>HIGH_PRIORITY</name>
                            <description>HIGH_PRIORITY gives a channel preferential treatment in issue scheduling: in each scheduling round, all high priority channels are considered first, and then only a single low priority channel, before returning to the high priority channels.

