ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            This only affects the order in which the DMA schedules channels. The DMA's bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput.</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>DMA Channel Enable. 
                            When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high)</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL1_CTRL</name>
                    <addressOffset>0x000002d0</addressOffset>
                    <description>Alias for channel 11 CTRL register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL1_CTRL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL1_READ_ADDR</name>
                    <addressOffset>0x000002d4</addressOffset>
                    <description>Alias for channel 11 READ_ADDR register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL1_READ_ADDR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL1_WRITE_ADDR</name>
                    <addressOffset>0x000002d8</addressOffset>
                    <description>Alias for channel 11 WRITE_ADDR register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL1_WRITE_ADDR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL1_TRANS_COUNT_TRIG</name>
                    <addressOffset>0x000002dc</addressOffset>
                    <description>Alias for channel 11 TRANS_COUNT register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL1_TRANS_COUNT_TRIG</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL2_CTRL</name>
                    <addressOffset>0x000002e0</addressOffset>
                    <description>Alias for channel 11 CTRL register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL2_CTRL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL2_TRANS_COUNT</name>
                    <addressOffset>0x000002e4</addressOffset>
                    <description>Alias for channel 11 TRANS_COUNT register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL2_TRANS_COUNT</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL2_READ_ADDR</name>
                    <addressOffset>0x000002e8</addressOffset>
                    <description>Alias for channel 11 READ_ADDR register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL2_READ_ADDR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL2_WRITE_ADDR_TRIG</name>
                    <addressOffset>0x000002ec</addressOffset>
                    <description>Alias for channel 11 WRITE_ADDR register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL2_WRITE_ADDR_TRIG</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL3_CTRL</name>
                    <addressOffset>0x000002f0</addressOffset>
                    <description>Alias for channel 11 CTRL register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL3_CTRL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL3_WRITE_ADDR</name>
                    <addressOffset>0x000002f4</addressOffset>
                    <description>Alias for channel 11 WRITE_ADDR register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL3_WRITE_ADDR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL3_TRANS_COUNT</name>
                    <addressOffset>0x000002f8</addressOffset>
                    <description>Alias for channel 11 TRANS_COUNT register</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL3_TRANS_COUNT</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_AL3_READ_ADDR_TRIG</name>
                    <addressOffset>0x000002fc</addressOffset>
                    <description>Alias for channel 11 READ_ADDR register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CH11_AL3_READ_ADDR_TRIG</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTR</name>
                    <addressOffset>0x00000400</addressOffset>
                    <description>Interrupt Status (raw)</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTR</name>
                            <description>Raw interrupt status for DMA Channels 0..15. Bit n corresponds to channel n. Ignores any masking or forcing. Channel interrupts can be cleared by writing a bit mask to INTR, INTS0 or INTS1.

                            Channel interrupts can be routed to either of two system-level IRQs based on INTE0 and INTE1.

                            This can be used vector different channel interrupts to different ISRs: this might be done to allow NVIC IRQ preemption for more time-critical channels, or to spread IRQ load across different cores.

