ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            It is also valid to ignore this behaviour and just use INTE0/INTS0/IRQ 0.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTE0</name>
                    <addressOffset>0x00000404</addressOffset>
                    <description>Interrupt Enables for IRQ 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTE0</name>
                            <description>Set bit n to pass interrupts from channel n to DMA IRQ 0.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF0</name>
                    <addressOffset>0x00000408</addressOffset>
                    <description>Force Interrupts</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTF0</name>
                            <description>Write 1s to force the corresponding bits in INTE0. The interrupt remains asserted until INTF0 is cleared.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTS0</name>
                    <addressOffset>0x0000040c</addressOffset>
                    <description>Interrupt Status for IRQ 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTS0</name>
                            <description>Indicates active channel interrupt requests which are currently causing IRQ 0 to be asserted. 
                            Channel interrupts can be cleared by writing a bit mask here.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTR1</name>
                    <addressOffset>0x00000410</addressOffset>
                    <description>Interrupt Status (raw)</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTR1</name>
                            <description>Raw interrupt status for DMA Channels 0..15. Bit n corresponds to channel n. Ignores any masking or forcing. Channel interrupts can be cleared by writing a bit mask to INTR, INTS0 or INTS1.

                            Channel interrupts can be routed to either of two system-level IRQs based on INTE0 and INTE1.

                            This can be used vector different channel interrupts to different ISRs: this might be done to allow NVIC IRQ preemption for more time-critical channels, or to spread IRQ load across different cores.

                            It is also valid to ignore this behaviour and just use INTE0/INTS0/IRQ 0.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTE1</name>
                    <addressOffset>0x00000414</addressOffset>
                    <description>Interrupt Enables for IRQ 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTE1</name>
                            <description>Set bit n to pass interrupts from channel n to DMA IRQ 1.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF1</name>
                    <addressOffset>0x00000418</addressOffset>
                    <description>Force Interrupts for IRQ 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTF1</name>
                            <description>Write 1s to force the corresponding bits in INTE0. The interrupt remains asserted until INTF0 is cleared.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTS1</name>
                    <addressOffset>0x0000041c</addressOffset>
                    <description>Interrupt Status (masked) for IRQ 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTS1</name>
                            <description>Indicates active channel interrupt requests which are currently causing IRQ 1 to be asserted. 
                            Channel interrupts can be cleared by writing a bit mask here.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER0</name>
                    <addressOffset>0x00000420</addressOffset>
                    <description>Pacing (X/Y) Fractional Timer 
                    The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>X</name>
                            <description>Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer.</description>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y</name>
                            <description>Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER1</name>
                    <addressOffset>0x00000424</addressOffset>
                    <description>Pacing (X/Y) Fractional Timer 
                    The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>X</name>
                            <description>Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer.</description>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y</name>
                            <description>Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER2</name>
                    <addressOffset>0x00000428</addressOffset>
                    <description>Pacing (X/Y) Fractional Timer 
                    The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>X</name>
                            <description>Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer.</description>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y</name>
                            <description>Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER3</name>
                    <addressOffset>0x0000042c</addressOffset>
                    <description>Pacing (X/Y) Fractional Timer 
                    The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>X</name>
                            <description>Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer.</description>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Y</name>
                            <description>Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MULTI_CHAN_TRIGGER</name>
                    <addressOffset>0x00000430</addressOffset>
                    <description>Trigger one or more channels simultaneously</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MULTI_CHAN_TRIGGER</name>
                            <description>Each bit in this register corresponds to a DMA channel. Writing a 1 to the relevant bit is the same as writing to that channel's trigger register; the channel will start if it is currently enabled and not already busy.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNIFF_CTRL</name>
                    <addressOffset>0x00000434</addressOffset>
                    <description>Sniffer Control</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT_INV</name>
                            <description>If set, the result appears inverted (bitwise complement) when read. This does not affect the way the checksum is calculated; the result is transformed on-the-fly between the result register and the bus.</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUT_REV</name>
                            <description>If set, the result appears bit-reversed when read. This does not affect the way the checksum is calculated; the result is transformed on-the-fly between the result register and the bus.</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BSWAP</name>
                            <description>Locally perform a byte reverse on the sniffed data, before feeding into checksum.

                            Note that the sniff hardware is downstream of the DMA channel byteswap performed in the read master: if channel CTRL_BSWAP and SNIFF_CTRL_BSWAP are both enabled, their effects cancel from the sniffer's point of view.</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALC</name>
                            <bitRange>[8:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CRC32</name>
                                    <value>0</value>
                                    <description>Calculate a CRC-32 (IEEE802.3 polynomial)</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRC32R</name>
                                    <value>1</value>
                                    <description>Calculate a CRC-32 (IEEE802.3 polynomial) with bit reversed data</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRC16</name>
                                    <value>2</value>
                                    <description>Calculate a CRC-16-CCITT</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRC16R</name>
                                    <value>3</value>
                                    <description>Calculate a CRC-16-CCITT with bit reversed data</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVEN</name>
                                    <value>14</value>
                                    <description>XOR reduction over all data. == 1 if the total 1 population count is odd.</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SUM</name>
                                    <value>15</value>
                                    <description>Calculate a simple 32-bit checksum (addition with a 32 bit accumulator)</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMACH</name>
                            <description>DMA channel for Sniffer to observe</description>
                            <bitRange>[4:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>Enable sniffer</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNIFF_DATA</name>
                    <addressOffset>0x00000438</addressOffset>
                    <description>Data accumulator for sniff hardware</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SNIFF_DATA</name>
                            <description>Write an initial seed value here before starting a DMA transfer on the channel indicated by SNIFF_CTRL_DMACH. The hardware will update this register each time it observes a read from the indicated channel. Once the channel completes, the final result can be read from this register.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FIFO_LEVELS</name>
                    <addressOffset>0x00000440</addressOffset>
                    <description>Debug RAF, WAF, TDF levels</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RAF_LVL</name>
                            <description>Current Read-Address-FIFO fill level</description>
                            <bitRange>[23:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WAF_LVL</name>
                            <description>Current Write-Address-FIFO fill level</description>
                            <bitRange>[15:8]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TDF_LVL</name>
                            <description>Current Transfer-Data-FIFO fill level</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHAN_ABORT</name>
                    <addressOffset>0x00000444</addressOffset>
                    <description>Abort an in-progress transfer sequence on one or more channels</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHAN_ABORT</name>
                            <description>Each bit corresponds to a channel. Writing a 1 aborts whatever transfer sequence is in progress on that channel. The bit will remain high until any in-flight transfers have been flushed through the address and data FIFOs.

                            After writing, this register must be polled until it returns all-zero. Until this point, it is unsafe to restart the channel.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>N_CHANNELS</name>
                    <addressOffset>0x00000448</addressOffset>
                    <description>The number of channels this DMA instance is equipped with. This DMA supports up to 16 hardware channels, but can be configured with as few as one, to minimise silicon area.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>N_CHANNELS</name>
                            <bitRange>[4:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH0_DBG_CTDREQ</name>
                    <addressOffset>0x00000800</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH0_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH0_DBG_TCR</name>
                    <addressOffset>0x00000804</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH0_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1_DBG_CTDREQ</name>
                    <addressOffset>0x00000840</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH1_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
