ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>CH1_DBG_TCR</name>
                    <addressOffset>0x00000844</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH1_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_DBG_CTDREQ</name>
                    <addressOffset>0x00000880</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH2_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2_DBG_TCR</name>
                    <addressOffset>0x00000884</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH2_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3_DBG_CTDREQ</name>
                    <addressOffset>0x000008c0</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH3_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3_DBG_TCR</name>
                    <addressOffset>0x000008c4</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH3_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4_DBG_CTDREQ</name>
                    <addressOffset>0x00000900</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH4_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4_DBG_TCR</name>
                    <addressOffset>0x00000904</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH4_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH5_DBG_CTDREQ</name>
                    <addressOffset>0x00000940</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH5_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH5_DBG_TCR</name>
                    <addressOffset>0x00000944</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH5_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6_DBG_CTDREQ</name>
                    <addressOffset>0x00000980</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH6_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6_DBG_TCR</name>
                    <addressOffset>0x00000984</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH6_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7_DBG_CTDREQ</name>
                    <addressOffset>0x000009c0</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH7_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7_DBG_TCR</name>
                    <addressOffset>0x000009c4</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH7_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH8_DBG_CTDREQ</name>
                    <addressOffset>0x00000a00</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH8_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH8_DBG_TCR</name>
                    <addressOffset>0x00000a04</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH8_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH9_DBG_CTDREQ</name>
                    <addressOffset>0x00000a40</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH9_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH9_DBG_TCR</name>
                    <addressOffset>0x00000a44</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH9_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH10_DBG_CTDREQ</name>
                    <addressOffset>0x00000a80</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH10_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH10_DBG_TCR</name>
                    <addressOffset>0x00000a84</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH10_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_DBG_CTDREQ</name>
                    <addressOffset>0x00000ac0</addressOffset>
                    <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH11_DBG_CTDREQ</name>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11_DBG_TCR</name>
                    <addressOffset>0x00000ac4</addressOffset>
                    <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH11_DBG_TCR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
