ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            Reset value: 0x1</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <value>0</value>
                                    <description>TX_OVER interrupt is masked</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <value>1</value>
                                    <description>TX_OVER interrupt is unmasked</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>M_RX_FULL</name>
                            <description>This bit masks the R_RX_FULL interrupt in IC_INTR_STAT register.

                            Reset value: 0x1</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <value>0</value>
                                    <description>RX_FULL interrupt is masked</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <value>1</value>
                                    <description>RX_FULL interrupt is unmasked</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>M_RX_OVER</name>
                            <description>This bit masks the R_RX_OVER interrupt in IC_INTR_STAT register.

                            Reset value: 0x1</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <value>0</value>
                                    <description>RX_OVER interrupt is masked</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <value>1</value>
                                    <description>RX_OVER interrupt is unmasked</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>M_RX_UNDER</name>
                            <description>This bit masks the R_RX_UNDER interrupt in IC_INTR_STAT register.

                            Reset value: 0x1</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <value>0</value>
                                    <description>RX_UNDER interrupt is masked</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <value>1</value>
                                    <description>RX_UNDER interrupt is unmasked</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_RAW_INTR_STAT</name>
                    <addressOffset>0x00000034</addressOffset>
                    <description>I2C Raw Interrupt Status Register

                    Unlike the IC_INTR_STAT register, these bits are not masked so they always show the true status of the DW_apb_i2c.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RESTART_DET</name>
                            <description>Indicates whether a RESTART condition has occurred on the I2C interface when DW_apb_i2c is operating in Slave mode and the slave is being addressed. Enabled only when IC_SLV_RESTART_DET_EN=1.

                            Note: However, in high-speed mode or during a START BYTE transfer, the RESTART comes before the address field as per the I2C protocol. In this case, the slave is not the addressed slave when the RESTART is issued, therefore DW_apb_i2c does not generate the RESTART_DET interrupt.

                            Reset value: 0x0</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>RESTART_DET interrupt is inactive</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>RESTART_DET interrupt is active</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GEN_CALL</name>
                            <description>Set only when a General Call address is received and it is acknowledged. It stays set until it is cleared either by disabling DW_apb_i2c or when the CPU reads bit 0 of the IC_CLR_GEN_CALL register. DW_apb_i2c stores the received data in the Rx buffer.

