ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            Reset value: 0x0</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>GEN_CALL interrupt is inactive</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>GEN_CALL interrupt is active</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>START_DET</name>
                            <description>Indicates whether a START or RESTART condition has occurred on the I2C interface regardless of whether DW_apb_i2c is operating in slave or master mode.

                            Reset value: 0x0</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>START_DET interrupt is inactive</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>START_DET interrupt is active</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STOP_DET</name>
                            <description>Indicates whether a STOP condition has occurred on the I2C interface regardless of whether DW_apb_i2c is operating in slave or master mode.

                            In Slave Mode: - If IC_CON[7]=1'b1  (STOP_DET_IFADDRESSED), the STOP_DET interrupt will be issued only if slave is addressed. Note: During a general call address, this slave does not issue a STOP_DET interrupt if STOP_DET_IF_ADDRESSED=1'b1, even if the slave responds to the general call address by generating ACK. The STOP_DET interrupt is generated only when the transmitted address matches the slave address (SAR). - If IC_CON[7]=1'b0 (STOP_DET_IFADDRESSED), the STOP_DET interrupt is issued irrespective of whether it is being addressed. In Master Mode: - If IC_CON[10]=1'b1  (STOP_DET_IF_MASTER_ACTIVE),the STOP_DET interrupt will be issued only if Master is active. - If IC_CON[10]=1'b0  (STOP_DET_IFADDRESSED),the STOP_DET interrupt will be issued irrespective of whether master is active or not. Reset value: 0x0</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>STOP_DET interrupt is inactive</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>STOP_DET interrupt is active</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ACTIVITY</name>
                            <description>This bit captures DW_apb_i2c activity and stays set until it is cleared. There are four ways to clear it: - Disabling the DW_apb_i2c - Reading the IC_CLR_ACTIVITY register - Reading the IC_CLR_INTR register - System reset Once this bit is set, it stays set unless one of the four methods is used to clear it. Even if the DW_apb_i2c module is idle, this bit remains set until cleared, indicating that there was activity on the bus.

                            Reset value: 0x0</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>RAW_INTR_ACTIVITY interrupt is inactive</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>RAW_INTR_ACTIVITY interrupt is active</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RX_DONE</name>
                            <description>When the DW_apb_i2c is acting as a slave-transmitter, this bit is set to 1 if the master does not acknowledge a transmitted byte. This occurs on the last byte of the transmission, indicating that the transmission is done.

                            Reset value: 0x0</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>RX_DONE interrupt is inactive</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>RX_DONE interrupt is active</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TX_ABRT</name>
                            <description>This bit indicates if DW_apb_i2c, as an I2C transmitter, is unable to complete the intended actions on the contents of the transmit FIFO. This situation can occur both as an I2C master or an I2C slave, and is referred to as a 'transmit abort'. When this bit is set to 1, the IC_TX_ABRT_SOURCE register indicates the reason why the transmit abort takes places.

                            Note:  The DW_apb_i2c flushes/resets/empties the TX_FIFO and RX_FIFO whenever there is a transmit abort caused by any of the events tracked by the IC_TX_ABRT_SOURCE register. The FIFOs remains in this flushed state until the register IC_CLR_TX_ABRT is read. Once this read is performed, the Tx FIFO is then ready to accept more data bytes from the APB interface.

