ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            Reset value: 0x0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_CLR_RX_UNDER</name>
                    <addressOffset>0x00000044</addressOffset>
                    <description>Clear RX_UNDER Interrupt Register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLR_RX_UNDER</name>
                            <description>Read this register to clear the RX_UNDER interrupt (bit 0) of the IC_RAW_INTR_STAT register.

                            Reset value: 0x0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_CLR_RX_OVER</name>
                    <addressOffset>0x00000048</addressOffset>
                    <description>Clear RX_OVER Interrupt Register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLR_RX_OVER</name>
                            <description>Read this register to clear the RX_OVER interrupt (bit 1) of the IC_RAW_INTR_STAT register.

                            Reset value: 0x0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_CLR_TX_OVER</name>
                    <addressOffset>0x0000004c</addressOffset>
                    <description>Clear TX_OVER Interrupt Register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLR_TX_OVER</name>
                            <description>Read this register to clear the TX_OVER interrupt (bit 3) of the IC_RAW_INTR_STAT register.

                            Reset value: 0x0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_CLR_RD_REQ</name>
                    <addressOffset>0x00000050</addressOffset>
                    <description>Clear RD_REQ Interrupt Register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLR_RD_REQ</name>
                            <description>Read this register to clear the RD_REQ interrupt (bit 5) of the IC_RAW_INTR_STAT register.

                            Reset value: 0x0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_CLR_TX_ABRT</name>
                    <addressOffset>0x00000054</addressOffset>
                    <description>Clear TX_ABRT Interrupt Register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLR_TX_ABRT</name>
                            <description>Read this register to clear the TX_ABRT interrupt (bit 6) of the IC_RAW_INTR_STAT register, and the IC_TX_ABRT_SOURCE register. This also releases the TX FIFO from the flushed/reset state, allowing more writes to the TX FIFO. Refer to Bit 9 of the IC_TX_ABRT_SOURCE register for an exception to clearing IC_TX_ABRT_SOURCE.

                            Reset value: 0x0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_CLR_RX_DONE</name>
                    <addressOffset>0x00000058</addressOffset>
                    <description>Clear RX_DONE Interrupt Register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLR_RX_DONE</name>
                            <description>Read this register to clear the RX_DONE interrupt (bit 7) of the IC_RAW_INTR_STAT register.

                            Reset value: 0x0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_CLR_ACTIVITY</name>
                    <addressOffset>0x0000005c</addressOffset>
                    <description>Clear ACTIVITY Interrupt Register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLR_ACTIVITY</name>
                            <description>Reading this register clears the ACTIVITY interrupt if the I2C is not active anymore. If the I2C module is still active on the bus, the ACTIVITY interrupt bit continues to be set. It is automatically cleared by hardware if the module is disabled and if there is no further activity on the bus. The value read from this register to get status of the ACTIVITY interrupt (bit 8) of the IC_RAW_INTR_STAT register.

