ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            Reset value: 0x0</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_RXFLR</name>
                    <addressOffset>0x00000078</addressOffset>
                    <description>I2C Receive FIFO Level Register This register contains the number of valid data entries in the receive FIFO buffer. It is cleared whenever: - The I2C is disabled - Whenever there is a transmit abort caused by any of the events tracked in IC_TX_ABRT_SOURCE The register increments whenever data is placed into the receive FIFO and decrements when data is taken from the receive FIFO.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFLR</name>
                            <description>Receive FIFO Level. Contains the number of valid data entries in the receive FIFO.

                            Reset value: 0x0</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_SDA_HOLD</name>
                    <addressOffset>0x0000007c</addressOffset>
                    <description>I2C SDA Hold Time Length Register

                    The bits [15:0] of this register are used to control the hold time of SDA during transmit in both slave and master mode (after SCL goes from HIGH to LOW).

                    The bits [23:16] of this register are used to extend the SDA transition (if any) whenever SCL is HIGH in the receiver in either master or slave mode.

                    Writes to this register succeed only when IC_ENABLE[0]=0.

                    The values in this register are in units of ic_clk period. The value programmed in IC_SDA_TX_HOLD must be greater than the minimum hold time in each mode (one cycle in master mode, seven cycles in slave mode) for the value to be implemented.

                    The programmed SDA hold time during transmit (IC_SDA_TX_HOLD) cannot exceed at any time the duration of the low part of scl. Therefore the programmed value cannot be larger than N_SCL_LOW-2, where N_SCL_LOW is the duration of the low part of the scl period measured in ic_clk cycles.</description>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>IC_SDA_RX_HOLD</name>
                            <description>Sets the required SDA hold time in units of ic_clk period, when DW_apb_i2c acts as a receiver.

                            Reset value: IC_DEFAULT_SDA_HOLD[23:16].</description>
                            <bitRange>[23:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IC_SDA_TX_HOLD</name>
                            <description>Sets the required SDA hold time in units of ic_clk period, when DW_apb_i2c acts as a transmitter.

                            Reset value: IC_DEFAULT_SDA_HOLD[15:0].</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_TX_ABRT_SOURCE</name>
                    <addressOffset>0x00000080</addressOffset>
                    <description>I2C Transmit Abort Source Register

                    This register has 32 bits that indicate the source of the TX_ABRT bit. Except for Bit 9, this register is cleared whenever the IC_CLR_TX_ABRT register or the IC_CLR_INTR register is read. To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed first; RESTART must be enabled (IC_CON[5]=1), the SPECIAL bit must be cleared (IC_TAR[11]), or the GC_OR_START bit must be cleared (IC_TAR[10]).

                    Once the source of the ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared in the same manner as other bits in this register. If the source of the ABRT_SBYTE_NORSTRT is not fixed before attempting to clear this bit, Bit 9 clears for one cycle and is then re-asserted.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TX_FLUSH_CNT</name>
                            <description>This field indicates the number of Tx FIFO Data Commands which are flushed due to TX_ABRT interrupt. It is cleared whenever I2C is disabled.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Slave-Transmitter</description>
                            <bitRange>[31:23]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ABRT_USER_ABRT</name>
                            <description>This is a master-mode-only bit. Master has detected the transfer abort (IC_ENABLE[1])

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_USER_ABRT_VOID</name>
                                    <value>0</value>
                                    <description>Transfer abort detected by master- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_USER_ABRT_GENERATED</name>
                                    <value>1</value>
                                    <description>Transfer abort detected by master</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_SLVRD_INTX</name>
                            <description>1: When the processor side responds to a slave mode request for data to be transmitted to a remote master and user writes a 1 in CMD (bit 8) of IC_DATA_CMD register.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Slave-Transmitter</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_SLVRD_INTX_VOID</name>
                                    <value>0</value>
                                    <description>Slave trying to transmit to remote master in read mode- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_SLVRD_INTX_GENERATED</name>
                                    <value>1</value>
                                    <description>Slave trying to transmit to remote master in read mode</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_SLV_ARBLOST</name>
                            <description>This field indicates that a Slave has lost the bus while transmitting data to a remote master. IC_TX_ABRT_SOURCE[12] is set at the same time. Note:  Even though the slave never 'owns' the bus, something could go wrong on the bus. This is a fail safe check. For instance, during a data transmission at the low-to-high transition of SCL, if what is on the data bus is not what is supposed to be transmitted, then DW_apb_i2c no longer own the bus.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Slave-Transmitter</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_SLV_ARBLOST_VOID</name>
                                    <value>0</value>
                                    <description>Slave lost arbitration to remote master- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_SLV_ARBLOST_GENERATED</name>
                                    <value>1</value>
                                    <description>Slave lost arbitration to remote master</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_SLVFLUSH_TXFIFO</name>
                            <description>This field specifies that the Slave has received a read command and some data exists in the TX FIFO, so the slave issues a TX_ABRT interrupt to flush old data in TX FIFO.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Slave-Transmitter</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_SLVFLUSH_TXFIFO_VOID</name>
                                    <value>0</value>
                                    <description>Slave flushes existing data in TX-FIFO upon getting read command- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_SLVFLUSH_TXFIFO_GENERATED</name>
                                    <value>1</value>
                                    <description>Slave flushes existing data in TX-FIFO upon getting read command</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ARB_LOST</name>
                            <description>This field specifies that the Master has lost arbitration, or if IC_TX_ABRT_SOURCE[14] is also set, then the slave transmitter has lost arbitration.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Slave-Transmitter</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_LOST_VOID</name>
                                    <value>0</value>
                                    <description>Master or Slave-Transmitter lost arbitration- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_LOST_GENERATED</name>
                                    <value>1</value>
                                    <description>Master or Slave-Transmitter lost arbitration</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_MASTER_DIS</name>
                            <description>This field indicates that the User tries to initiate a Master operation with the Master mode disabled.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_MASTER_DIS_VOID</name>
                                    <value>0</value>
                                    <description>User initiating master operation when MASTER disabled- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_MASTER_DIS_GENERATED</name>
                                    <value>1</value>
                                    <description>User initiating master operation when MASTER disabled</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_10B_RD_NORSTRT</name>
                            <description>This field indicates that the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the master sends a read command in 10-bit addressing mode.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Receiver</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_10B_RD_VOID</name>
                                    <value>0</value>
                                    <description>Master not trying to read in 10Bit addressing mode when RESTART disabled</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_10B_RD_GENERATED</name>
                                    <value>1</value>
                                    <description>Master trying to read in 10Bit addressing mode when RESTART disabled</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_SBYTE_NORSTRT</name>
                            <description>To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed first; restart must be enabled (IC_CON[5]=1), the SPECIAL bit must be cleared (IC_TAR[11]), or the GC_OR_START bit must be cleared (IC_TAR[10]). Once the source of the ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared in the same manner as other bits in this register. If the source of the ABRT_SBYTE_NORSTRT is not fixed before attempting to clear this bit, bit 9 clears for one cycle and then gets reasserted. When this field is set to 1, the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the user is trying to send a START Byte.

                            Reset value: 0x0

