ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            Role of DW_apb_i2c:  Master</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_SBYTE_NORSTRT_VOID</name>
                                    <value>0</value>
                                    <description>User trying to send START byte when RESTART disabled- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_SBYTE_NORSTRT_GENERATED</name>
                                    <value>1</value>
                                    <description>User trying to send START byte when RESTART disabled</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_HS_NORSTRT</name>
                            <description>This field indicates that the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the user is trying to use the master to transfer data in High Speed mode.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_HS_NORSTRT_VOID</name>
                                    <value>0</value>
                                    <description>User trying to switch Master to HS mode when RESTART disabled- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_HS_NORSTRT_GENERATED</name>
                                    <value>1</value>
                                    <description>User trying to switch Master to HS mode when RESTART disabled</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_SBYTE_ACKDET</name>
                            <description>This field indicates that the Master has sent a START Byte and the START Byte was acknowledged (wrong behavior).

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_SBYTE_ACKDET_VOID</name>
                                    <value>0</value>
                                    <description>ACK detected for START byte- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_SBYTE_ACKDET_GENERATED</name>
                                    <value>1</value>
                                    <description>ACK detected for START byte</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_HS_ACKDET</name>
                            <description>This field indicates that the Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior).

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_HS_ACK_VOID</name>
                                    <value>0</value>
                                    <description>HS Master code ACKed in HS Mode- scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_HS_ACK_GENERATED</name>
                                    <value>1</value>
                                    <description>HS Master code ACKed in HS Mode</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_GCALL_READ</name>
                            <description>This field indicates that DW_apb_i2c in the master mode has sent a General Call but the user programmed the byte following the General Call to be a read from the bus (IC_DATA_CMD[9] is set to 1).

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_GCALL_READ_VOID</name>
                                    <value>0</value>
                                    <description>GCALL is followed by read from bus-scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_GCALL_READ_GENERATED</name>
                                    <value>1</value>
                                    <description>GCALL is followed by read from bus</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_GCALL_NOACK</name>
                            <description>This field indicates that DW_apb_i2c in master mode has sent a General Call and no slave on the bus acknowledged the General Call.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_GCALL_NOACK_VOID</name>
                                    <value>0</value>
                                    <description>GCALL not ACKed by any slave-scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_GCALL_NOACK_GENERATED</name>
                                    <value>1</value>
                                    <description>GCALL not ACKed by any slave</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_TXDATA_NOACK</name>
                            <description>This field indicates the master-mode only bit. When the master receives an acknowledgement for the address, but when it sends data byte(s) following the address, it did not receive an acknowledge from the remote slave(s).

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ABRT_TXDATA_NOACK_VOID</name>
                                    <value>0</value>
                                    <description>Transmitted data non-ACKed by addressed slave-scenario not present</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ABRT_TXDATA_NOACK_GENERATED</name>
                                    <value>1</value>
                                    <description>Transmitted data not ACKed by addressed slave</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_10ADDR2_NOACK</name>
                            <description>This field indicates that the Master is in 10-bit address mode and that the second address byte of the 10-bit address was not acknowledged by any slave.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>This abort is not generated</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>Byte 2 of 10Bit Address not ACKed by any slave</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_10ADDR1_NOACK</name>
                            <description>This field indicates that the Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>This abort is not generated</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>Byte 1 of 10Bit Address not ACKed by any slave</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABRT_7B_ADDR_NOACK</name>
                            <description>This field indicates that the Master is in 7-bit addressing mode and the address sent was not acknowledged by any slave.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>This abort is not generated</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>This abort is generated because of NOACK for 7-bit address</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_SLV_DATA_NACK_ONLY</name>
                    <addressOffset>0x00000084</addressOffset>
                    <description>Generate Slave Data NACK Register

