ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            (a) DW_apb_i2c is receiving the address byte of the Slave-Transmitter operation from a remote master;

                            OR,

                            (b) address and data bytes of the Slave-Receiver operation from a remote master.

                            When read as 1, DW_apb_i2c is deemed to have forced a NACK during any part of an I2C transfer, irrespective of whether the I2C address matches the slave address set in DW_apb_i2c (IC_SAR register) OR if the transfer is completed before IC_ENABLE is set to 0 but has not taken effect.

                            Note:  If the remote I2C master terminates the transfer with a STOP condition before the DW_apb_i2c has a chance to NACK a transfer, and IC_ENABLE[0] has been set to 0, then this bit will also be set to 1.

                            When read as 0, DW_apb_i2c is deemed to have been disabled when there is master activity, or when the I2C bus is idle.

                            Note:  The CPU can safely read this bit when IC_EN (bit 0) is read as 0.

                            Reset value: 0x0</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <value>0</value>
                                    <description>Slave is disabled when it is idle</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <value>1</value>
                                    <description>Slave is disabled when it is active</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IC_EN</name>
                            <description>ic_en Status. This bit always reflects the value driven on the output port ic_en. - When read as 1, DW_apb_i2c is deemed to be in an enabled state. - When read as 0, DW_apb_i2c is deemed completely inactive. Note:  The CPU can safely read this bit anytime. When this bit is read as 0, the CPU can safely read SLV_RX_DATA_LOST (bit 2) and SLV_DISABLED_WHILE_BUSY (bit 1).

                            Reset value: 0x0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <value>0</value>
                                    <description>I2C disabled</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <value>1</value>
                                    <description>I2C enabled</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_FS_SPKLEN</name>
                    <addressOffset>0x000000a0</addressOffset>
                    <description>I2C SS, FS or FM+ spike suppression limit

                    This register is used to store the duration, measured in ic_clk cycles, of the longest spike that is filtered out by the spike suppression logic when the component is operating in SS, FS or FM+ modes. The relevant I2C requirement is tSP (table 4) as detailed in the I2C Bus Specification. This register must be programmed with a minimum value of 1.</description>
                    <resetValue>0x00000007</resetValue>
                    <fields>
                        <field>
                            <name>IC_FS_SPKLEN</name>
                            <description>This register must be set before any I2C bus transaction can take place to ensure stable operation. This register sets the duration, measured in ic_clk cycles, of the longest spike in the SCL or SDA lines that will be filtered out by the spike suppression logic. This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect. The minimum valid value is 1; hardware prevents values less than this being written, and if attempted results in 1 being set. or more information, refer to 'Spike Suppression'.</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_CLR_RESTART_DET</name>
                    <addressOffset>0x000000a8</addressOffset>
                    <description>Clear RESTART_DET Interrupt Register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLR_RESTART_DET</name>
                            <description>Read this register to clear the RESTART_DET interrupt (bit 12) of IC_RAW_INTR_STAT register.

                            Reset value: 0x0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IC_COMP_PARAM_1</name>
                    <addressOffset>0x000000f4</addressOffset>
                    <description>Component Parameter Register 1

