ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>SSPPERIPHID2</name>
                    <addressOffset>0x00000fe8</addressOffset>
                    <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
                    <resetValue>0x00000034</resetValue>
                    <fields>
                        <field>
                            <name>REVISION</name>
                            <description>These bits return the peripheral revision</description>
                            <bitRange>[7:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DESIGNER1</name>
                            <description>These bits read back as 0x4</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSPPERIPHID3</name>
                    <addressOffset>0x00000fec</addressOffset>
                    <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CONFIGURATION</name>
                            <description>These bits read back as 0x00</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSPPCELLID0</name>
                    <addressOffset>0x00000ff0</addressOffset>
                    <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                    <resetValue>0x0000000d</resetValue>
                    <fields>
                        <field>
                            <name>SSPPCELLID0</name>
                            <description>These bits read back as 0x0D</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSPPCELLID1</name>
                    <addressOffset>0x00000ff4</addressOffset>
                    <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                    <resetValue>0x000000f0</resetValue>
                    <fields>
                        <field>
                            <name>SSPPCELLID1</name>
                            <description>These bits read back as 0xF0</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSPPCELLID2</name>
                    <addressOffset>0x00000ff8</addressOffset>
                    <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                    <resetValue>0x00000005</resetValue>
                    <fields>
                        <field>
                            <name>SSPPCELLID2</name>
                            <description>These bits read back as 0x05</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSPPCELLID3</name>
                    <addressOffset>0x00000ffc</addressOffset>
                    <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                    <resetValue>0x000000b1</resetValue>
                    <fields>
                        <field>
                            <name>SSPPCELLID3</name>
                            <description>These bits read back as 0xB1</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="SPI0">
            <name>SPI1</name>
            <baseAddress>0x40040000</baseAddress>
            <interrupt>
                <name>SPI1_IRQ</name>
                <value>19</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>PIO0</name>
            <description>Programmable IO block</description>
            <baseAddress>0x50200000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>324</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PIO0_IRQ_0</name>
                <value>7</value>
            </interrupt>
            <interrupt>
                <name>PIO0_IRQ_1</name>
                <value>8</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>PIO control register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKDIV_RESTART</name>
                            <description>Restart a state machine's clock divider from an initial phase of 0. Clock dividers are free-running, so once started, their output (including fractional jitter) is completely determined by the integer/fractional divisor configured in SMx_CLKDIV. This means that, if multiple clock dividers with the same divisor are restarted simultaneously, by writing multiple 1 bits to this field, the execution clocks of those state machines will run in precise lockstep.

                            Note that setting/clearing SM_ENABLE does not stop the clock divider from running, so once multiple state machines' clocks are synchronised, it is safe to disable/reenable a state machine, whilst keeping the clock dividers in sync.

