ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            Note also that CLKDIV_RESTART can be written to whilst the state machine is running, and this is useful to resynchronise clock dividers after the divisors (SMx_CLKDIV) have been changed on-the-fly.</description>
                            <bitRange>[11:8]</bitRange>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SM_RESTART</name>
                            <description>Write 1 to instantly clear internal SM state which may be otherwise difficult to access and will affect future execution.

                            Specifically, the following are cleared: input and output shift counters; the contents of the input shift register; the delay counter; the waiting-on-IRQ state; any stalled instruction written to SMx_INSTR or run by OUT/MOV EXEC; any pin write left asserted due to OUT_STICKY.

                            The program counter, the contents of the output shift register and the X/Y scratch registers are not affected.</description>
                            <bitRange>[7:4]</bitRange>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SM_ENABLE</name>
                            <description>Enable/disable each of the four state machines by writing 1/0 to each of these four bits. When disabled, a state machine will cease executing instructions, except those written directly to SMx_INSTR by the system. Multiple bits can be set/cleared at once to run/halt multiple state machines simultaneously.</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSTAT</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>FIFO status register</description>
                    <resetValue>0x0f000f00</resetValue>
                    <fields>
                        <field>
                            <name>TXEMPTY</name>
                            <description>State machine TX FIFO is empty</description>
                            <bitRange>[27:24]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXFULL</name>
                            <description>State machine TX FIFO is full</description>
                            <bitRange>[19:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXEMPTY</name>
                            <description>State machine RX FIFO is empty</description>
                            <bitRange>[11:8]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXFULL</name>
                            <description>State machine RX FIFO is full</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FDEBUG</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>FIFO debug register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXSTALL</name>
                            <description>State machine has stalled on empty TX FIFO during a blocking PULL, or an OUT with autopull enabled. Write 1 to clear.</description>
                            <bitRange>[27:24]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>TXOVER</name>
                            <description>TX FIFO overflow (i.e. write-on-full by the system) has occurred. Write 1 to clear. Note that write-on-full does not alter the state or contents of the FIFO in any way, but the data that the system attempted to write is dropped, so if this flag is set, your software has quite likely dropped some data on the floor.</description>
                            <bitRange>[19:16]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>RXUNDER</name>
                            <description>RX FIFO underflow (i.e. read-on-empty by the system) has occurred. Write 1 to clear. Note that read-on-empty does not perturb the state of the FIFO in any way, but the data returned by reading from an empty FIFO is undefined, so this flag generally only becomes set due to some kind of software error.</description>
                            <bitRange>[11:8]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>RXSTALL</name>
                            <description>State machine has stalled on full RX FIFO during a blocking PUSH, or an IN with autopush enabled. This flag is also set when a nonblocking PUSH to a full FIFO took place, in which case the state machine has dropped data. Write 1 to clear.</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLEVEL</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>FIFO levels</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RX3</name>
                            <bitRange>[31:28]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TX3</name>
                            <bitRange>[27:24]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RX2</name>
                            <bitRange>[23:20]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TX2</name>
                            <bitRange>[19:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RX1</name>
                            <bitRange>[15:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TX1</name>
                            <bitRange>[11:8]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RX0</name>
                            <bitRange>[7:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TX0</name>
                            <bitRange>[3:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXF0</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXF0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXF1</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXF1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXF2</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXF2</name>
                            <bitRange>[31:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXF3</name>
                    <addressOffset>0x0000001c</addressOffset>
                    <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXF3</name>
                            <bitRange>[31:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXF0</name>
                    <addressOffset>0x00000020</addressOffset>
                    <description>Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. Attempting to read from an empty FIFO has no effect on the FIFO state, and sets the sticky FDEBUG_RXUNDER error flag for this FIFO. The data returned to the system on a read from an empty FIFO is undefined.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RXF0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXF1</name>
                    <addressOffset>0x00000024</addressOffset>
                    <description>Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. Attempting to read from an empty FIFO has no effect on the FIFO state, and sets the sticky FDEBUG_RXUNDER error flag for this FIFO. The data returned to the system on a read from an empty FIFO is undefined.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RXF1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXF2</name>
                    <addressOffset>0x00000028</addressOffset>
                    <description>Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. Attempting to read from an empty FIFO has no effect on the FIFO state, and sets the sticky FDEBUG_RXUNDER error flag for this FIFO. The data returned to the system on a read from an empty FIFO is undefined.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RXF2</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXF3</name>
                    <addressOffset>0x0000002c</addressOffset>
                    <description>Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. Attempting to read from an empty FIFO has no effect on the FIFO state, and sets the sticky FDEBUG_RXUNDER error flag for this FIFO. The data returned to the system on a read from an empty FIFO is undefined.</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RXF3</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ</name>
                    <addressOffset>0x00000030</addressOffset>
                    <description>State machine IRQ flags register. Write 1 to clear. There are 8 state machine IRQ flags, which can be set, cleared, and waited on by the state machines. There's no fixed association between flags and state machines -- any state machine can use any flag.

                    Any of the 8 flags can be used for timing synchronisation between state machines, using IRQ and WAIT instructions. The lower four of these flags are also routed out to system-level interrupt requests, alongside FIFO status interrupts -- see e.g. IRQ0_INTE.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IRQ</name>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ_FORCE</name>
                    <addressOffset>0x00000034</addressOffset>
                    <description>Writing a 1 to each of these bits will forcibly assert the corresponding IRQ. Note this is different to the INTF register: writing here affects PIO internal state. INTF just asserts the processor-facing IRQ signal for testing ISRs, and is not visible to the state machines.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IRQ_FORCE</name>
                            <bitRange>[7:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INPUT_SYNC_BYPASS</name>
                    <addressOffset>0x00000038</addressOffset>
                    <description>There is a 2-flipflop synchronizer on each GPIO input, which protects PIO logic from metastabilities. This increases input delay, and for fast synchronous IO (e.g. SPI) these synchronizers may need to be bypassed. Each bit in this register corresponds to one GPIO. 
                    0 -&gt; input is synchronized (default) 
                    1 -&gt; synchronizer is bypassed 
                    If in doubt, leave this register as all zeroes.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INPUT_SYNC_BYPASS</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DBG_PADOUT</name>
                    <addressOffset>0x0000003c</addressOffset>
                    <description>Read to sample the pad output values PIO is currently driving to the GPIOs. On RP2040 there are 30 GPIOs, so the two most significant bits are hardwired to 0.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DBG_PADOUT</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DBG_PADOE</name>
                    <addressOffset>0x00000040</addressOffset>
                    <description>Read to sample the pad output enables (direction) PIO is currently driving to the GPIOs. On RP2040 there are 30 GPIOs, so the two most significant bits are hardwired to 0.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DBG_PADOE</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DBG_CFGINFO</name>
                    <addressOffset>0x00000044</addressOffset>
                    <description>The PIO hardware has some free parameters that may vary between chip products. 
                    These should be provided in the chip datasheet, but are also exposed here.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IMEM_SIZE</name>
                            <description>The size of the instruction memory, measured in units of one instruction</description>
                            <bitRange>[21:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SM_COUNT</name>
                            <description>The number of state machines this PIO instance is equipped with.</description>
                            <bitRange>[11:8]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FIFO_DEPTH</name>
                            <description>The depth of the state machine TX/RX FIFOs, measured in words. 
                            Joining fifos via SHIFTCTRL_FJOIN gives one FIFO with double 
                            this depth.</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM0</name>
                    <addressOffset>0x00000048</addressOffset>
                    <description>Write-only access to instruction memory location 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM0</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM1</name>
                    <addressOffset>0x0000004c</addressOffset>
                    <description>Write-only access to instruction memory location 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM1</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM2</name>
                    <addressOffset>0x00000050</addressOffset>
                    <description>Write-only access to instruction memory location 2</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM2</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM3</name>
                    <addressOffset>0x00000054</addressOffset>
                    <description>Write-only access to instruction memory location 3</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM3</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
