ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>INSTR_MEM4</name>
                    <addressOffset>0x00000058</addressOffset>
                    <description>Write-only access to instruction memory location 4</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM4</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM5</name>
                    <addressOffset>0x0000005c</addressOffset>
                    <description>Write-only access to instruction memory location 5</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM5</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM6</name>
                    <addressOffset>0x00000060</addressOffset>
                    <description>Write-only access to instruction memory location 6</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM6</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM7</name>
                    <addressOffset>0x00000064</addressOffset>
                    <description>Write-only access to instruction memory location 7</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM7</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM8</name>
                    <addressOffset>0x00000068</addressOffset>
                    <description>Write-only access to instruction memory location 8</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM8</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM9</name>
                    <addressOffset>0x0000006c</addressOffset>
                    <description>Write-only access to instruction memory location 9</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM9</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM10</name>
                    <addressOffset>0x00000070</addressOffset>
                    <description>Write-only access to instruction memory location 10</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM10</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM11</name>
                    <addressOffset>0x00000074</addressOffset>
                    <description>Write-only access to instruction memory location 11</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM11</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM12</name>
                    <addressOffset>0x00000078</addressOffset>
                    <description>Write-only access to instruction memory location 12</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM12</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM13</name>
                    <addressOffset>0x0000007c</addressOffset>
                    <description>Write-only access to instruction memory location 13</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM13</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM14</name>
                    <addressOffset>0x00000080</addressOffset>
                    <description>Write-only access to instruction memory location 14</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM14</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM15</name>
                    <addressOffset>0x00000084</addressOffset>
                    <description>Write-only access to instruction memory location 15</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM15</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM16</name>
                    <addressOffset>0x00000088</addressOffset>
                    <description>Write-only access to instruction memory location 16</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM16</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM17</name>
                    <addressOffset>0x0000008c</addressOffset>
                    <description>Write-only access to instruction memory location 17</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM17</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM18</name>
                    <addressOffset>0x00000090</addressOffset>
                    <description>Write-only access to instruction memory location 18</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM18</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM19</name>
                    <addressOffset>0x00000094</addressOffset>
                    <description>Write-only access to instruction memory location 19</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM19</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM20</name>
                    <addressOffset>0x00000098</addressOffset>
                    <description>Write-only access to instruction memory location 20</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM20</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM21</name>
                    <addressOffset>0x0000009c</addressOffset>
                    <description>Write-only access to instruction memory location 21</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM21</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM22</name>
                    <addressOffset>0x000000a0</addressOffset>
                    <description>Write-only access to instruction memory location 22</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM22</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM23</name>
                    <addressOffset>0x000000a4</addressOffset>
                    <description>Write-only access to instruction memory location 23</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM23</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM24</name>
                    <addressOffset>0x000000a8</addressOffset>
                    <description>Write-only access to instruction memory location 24</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM24</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM25</name>
                    <addressOffset>0x000000ac</addressOffset>
                    <description>Write-only access to instruction memory location 25</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM25</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM26</name>
                    <addressOffset>0x000000b0</addressOffset>
                    <description>Write-only access to instruction memory location 26</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM26</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM27</name>
                    <addressOffset>0x000000b4</addressOffset>
                    <description>Write-only access to instruction memory location 27</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM27</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM28</name>
                    <addressOffset>0x000000b8</addressOffset>
                    <description>Write-only access to instruction memory location 28</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM28</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM29</name>
                    <addressOffset>0x000000bc</addressOffset>
                    <description>Write-only access to instruction memory location 29</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM29</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM30</name>
                    <addressOffset>0x000000c0</addressOffset>
                    <description>Write-only access to instruction memory location 30</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM30</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INSTR_MEM31</name>
                    <addressOffset>0x000000c4</addressOffset>
                    <description>Write-only access to instruction memory location 31</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTR_MEM31</name>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SM0_CLKDIV</name>
                    <addressOffset>0x000000c8</addressOffset>
                    <description>Clock divisor register for state machine 0 
                    Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)</description>
                    <resetValue>0x00010000</resetValue>
                    <fields>
                        <field>
                            <name>INT</name>
                            <description>Effective frequency is sysclk/(int + frac/256). 
                            Value of 0 is interpreted as 65536. If INT is 0, FRAC must also be 0.</description>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRAC</name>
                            <description>Fractional part of clock divisor</description>
                            <bitRange>[15:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SM0_EXECCTRL</name>
                    <addressOffset>0x000000cc</addressOffset>
                    <description>Execution/behavioural settings for state machine 0</description>
                    <resetValue>0x0001f000</resetValue>
                    <fields>
                        <field>
                            <name>EXEC_STALLED</name>
                            <description>If 1, an instruction written to SMx_INSTR is stalled, and latched by the state machine. Will clear to 0 once this instruction completes.</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SIDE_EN</name>
                            <description>If 1, the MSB of the Delay/Side-set instruction field is used as side-set enable, rather than a side-set data bit. This allows instructions to perform side-set optionally, rather than on every instruction, but the maximum possible side-set width is reduced from 5 to 4. Note that the value of PINCTRL_SIDESET_COUNT is inclusive of this enable bit.</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIDE_PINDIR</name>
                            <description>If 1, side-set data is asserted to pin directions, instead of pin values</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>JMP_PIN</name>
                            <description>The GPIO number to use as condition for JMP PIN. Unaffected by input mapping.</description>
                            <bitRange>[28:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUT_EN_SEL</name>
                            <description>Which data bit to use for inline OUT enable</description>
                            <bitRange>[23:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INLINE_OUT_EN</name>
                            <description>If 1, use a bit of OUT data as an auxiliary write enable 
                            When used in conjunction with OUT_STICKY, writes with an enable of 0 will 
                            deassert the latest pin write. This can create useful masking/override behaviour 
                            due to the priority ordering of state machine pin writes (SM0 &lt; SM1 &lt; ...)</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUT_STICKY</name>
                            <description>Continuously assert the most recent OUT/SET to the pins</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WRAP_TOP</name>
                            <description>After reaching this address, execution is wrapped to wrap_bottom. 
                            If the instruction is a jump, and the jump condition is true, the jump takes priority.</description>
                            <bitRange>[16:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WRAP_BOTTOM</name>
                            <description>After reaching wrap_top, execution is wrapped to this address.</description>
                            <bitRange>[11:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STATUS_SEL</name>
                            <description>Comparison used for the MOV x, STATUS instruction.</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TXLEVEL</name>
                                    <value>0</value>
                                    <description>All-ones if TX FIFO level &lt; N, otherwise all-zeroes</description>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXLEVEL</name>
                                    <value>1</value>
                                    <description>All-ones if RX FIFO level &lt; N, otherwise all-zeroes</description>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATUS_N</name>
                            <description>Comparison level for the MOV x, STATUS instruction</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
