ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral derivedFrom="PIO0">
            <name>PIO1</name>
            <baseAddress>0x50300000</baseAddress>
            <interrupt>
                <name>PIO1_IRQ_0</name>
                <value>9</value>
            </interrupt>
            <interrupt>
                <name>PIO1_IRQ_1</name>
                <value>10</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>BUSCTRL</name>
            <description>Register block for busfabric control signals and performance counters</description>
            <baseAddress>0x40030000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>BUS_PRIORITY</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Set the priority of each master for bus arbitration.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMA_W</name>
                            <description>0 - low priority, 1 - high priority</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA_R</name>
                            <description>0 - low priority, 1 - high priority</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC1</name>
                            <description>0 - low priority, 1 - high priority</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROC0</name>
                            <description>0 - low priority, 1 - high priority</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUS_PRIORITY_ACK</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Bus priority acknowledge</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BUS_PRIORITY_ACK</name>
                            <description>Goes to 1 once all arbiters have registered the new global priority levels. 
                            Arbiters update their local priority when servicing a new nonsequential access. 
                            In normal circumstances this will happen almost immediately.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERFCTR0</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>Bus fabric performance counter 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PERFCTR0</name>
                            <description>Busfabric saturating performance counter 0 
                            Count some event signal from the busfabric arbiters. 
                            Write any value to clear. Select an event to count using PERFSEL0</description>
                            <bitRange>[23:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERFSEL0</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>Bus fabric performance event select for PERFCTR0</description>
                    <resetValue>0x0000001f</resetValue>
                    <fields>
                        <field>
                            <name>PERFSEL0</name>
                            <description>Select an event for PERFCTR0. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>apb_contested</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>apb</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fastperi_contested</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fastperi</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram5_contested</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram5</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram4_contested</name>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram4</name>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram3_contested</name>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram3</name>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram2_contested</name>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram2</name>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram1_contested</name>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram1</name>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram0_contested</name>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram0</name>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xip_main_contested</name>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xip_main</name>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rom_contested</name>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rom</name>
                                    <value>19</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERFCTR1</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>Bus fabric performance counter 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PERFCTR1</name>
                            <description>Busfabric saturating performance counter 1 
                            Count some event signal from the busfabric arbiters. 
                            Write any value to clear. Select an event to count using PERFSEL1</description>
                            <bitRange>[23:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERFSEL1</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>Bus fabric performance event select for PERFCTR1</description>
                    <resetValue>0x0000001f</resetValue>
                    <fields>
                        <field>
                            <name>PERFSEL1</name>
                            <description>Select an event for PERFCTR1. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>apb_contested</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>apb</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fastperi_contested</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fastperi</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram5_contested</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram5</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram4_contested</name>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram4</name>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram3_contested</name>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram3</name>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram2_contested</name>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram2</name>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram1_contested</name>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram1</name>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram0_contested</name>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram0</name>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xip_main_contested</name>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xip_main</name>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rom_contested</name>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rom</name>
                                    <value>19</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERFCTR2</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>Bus fabric performance counter 2</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PERFCTR2</name>
                            <description>Busfabric saturating performance counter 2 
                            Count some event signal from the busfabric arbiters. 
                            Write any value to clear. Select an event to count using PERFSEL2</description>
                            <bitRange>[23:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERFSEL2</name>
                    <addressOffset>0x0000001c</addressOffset>
                    <description>Bus fabric performance event select for PERFCTR2</description>
                    <resetValue>0x0000001f</resetValue>
                    <fields>
                        <field>
                            <name>PERFSEL2</name>
                            <description>Select an event for PERFCTR2. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>apb_contested</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>apb</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fastperi_contested</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fastperi</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram5_contested</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram5</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram4_contested</name>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram4</name>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram3_contested</name>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram3</name>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram2_contested</name>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram2</name>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram1_contested</name>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram1</name>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram0_contested</name>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram0</name>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xip_main_contested</name>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xip_main</name>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rom_contested</name>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rom</name>
                                    <value>19</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERFCTR3</name>
                    <addressOffset>0x00000020</addressOffset>
                    <description>Bus fabric performance counter 3</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PERFCTR3</name>
                            <description>Busfabric saturating performance counter 3 
                            Count some event signal from the busfabric arbiters. 
                            Write any value to clear. Select an event to count using PERFSEL3</description>
                            <bitRange>[23:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
