ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>PERFSEL3</name>
                    <addressOffset>0x00000024</addressOffset>
                    <description>Bus fabric performance event select for PERFCTR3</description>
                    <resetValue>0x0000001f</resetValue>
                    <fields>
                        <field>
                            <name>PERFSEL3</name>
                            <description>Select an event for PERFCTR3. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>apb_contested</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>apb</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fastperi_contested</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fastperi</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram5_contested</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram5</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram4_contested</name>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram4</name>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram3_contested</name>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram3</name>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram2_contested</name>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram2</name>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram1_contested</name>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram1</name>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram0_contested</name>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>sram0</name>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xip_main_contested</name>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>xip_main</name>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rom_contested</name>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>rom</name>
                                    <value>19</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>SIO</name>
            <description>Single-cycle IO block 
            Provides core-local and inter-core hardware for the two processors, with single-cycle access.</description>
            <baseAddress>0xd0000000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>384</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SIO_IRQ_PROC0</name>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>SIO_IRQ_PROC1</name>
                <value>16</value>
            </interrupt>
            <registers>
                <register>
                    <name>CPUID</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Processor core identifier</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CPUID</name>
                            <description>Value is 0 when read from processor core 0, and 1 when read from processor core 1.</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_IN</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Input value for GPIO pins</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_IN</name>
                            <description>Input value for GPIO0...29</description>
                            <bitRange>[29:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_HI_IN</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>Input value for QSPI pins</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_HI_IN</name>
                            <description>Input value on QSPI IO in order 0..5: SCLK, SSn, SD0, SD1, SD2, SD3</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>GPIO output value</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT</name>
                            <description>Set output level (1/0 -&gt; high/low) for GPIO0...29. 
                            Reading back gives the last value written, NOT the input value from the pins. 
                            If core 0 and core 1 both write to GPIO_OUT simultaneously (or to a SET/CLR/XOR alias), 
                            the result is as though the write from core 0 took place first, 
                            and the write from core 1 was then applied to that intermediate result.</description>
                            <bitRange>[29:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT_SET</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>GPIO output value set</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT_SET</name>
                            <description>Perform an atomic bit-set on GPIO_OUT, i.e. `GPIO_OUT |= wdata`</description>
                            <bitRange>[29:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT_CLR</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>GPIO output value clear</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT_CLR</name>
                            <description>Perform an atomic bit-clear on GPIO_OUT, i.e. `GPIO_OUT &amp;= ~wdata`</description>
                            <bitRange>[29:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT_XOR</name>
                    <addressOffset>0x0000001c</addressOffset>
                    <description>GPIO output value XOR</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT_XOR</name>
                            <description>Perform an atomic bitwise XOR on GPIO_OUT, i.e. `GPIO_OUT ^= wdata`</description>
                            <bitRange>[29:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OE</name>
                    <addressOffset>0x00000020</addressOffset>
                    <description>GPIO output enable</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OE</name>
                            <description>Set output enable (1/0 -&gt; output/input) for GPIO0...29. 
                            Reading back gives the last value written. 
                            If core 0 and core 1 both write to GPIO_OE simultaneously (or to a SET/CLR/XOR alias), 
                            the result is as though the write from core 0 took place first, 
                            and the write from core 1 was then applied to that intermediate result.</description>
                            <bitRange>[29:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OE_SET</name>
                    <addressOffset>0x00000024</addressOffset>
                    <description>GPIO output enable set</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OE_SET</name>
                            <description>Perform an atomic bit-set on GPIO_OE, i.e. `GPIO_OE |= wdata`</description>
                            <bitRange>[29:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OE_CLR</name>
                    <addressOffset>0x00000028</addressOffset>
                    <description>GPIO output enable clear</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OE_CLR</name>
                            <description>Perform an atomic bit-clear on GPIO_OE, i.e. `GPIO_OE &amp;= ~wdata`</description>
                            <bitRange>[29:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OE_XOR</name>
                    <addressOffset>0x0000002c</addressOffset>
                    <description>GPIO output enable XOR</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OE_XOR</name>
                            <description>Perform an atomic bitwise XOR on GPIO_OE, i.e. `GPIO_OE ^= wdata`</description>
                            <bitRange>[29:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_HI_OUT</name>
                    <addressOffset>0x00000030</addressOffset>
                    <description>QSPI output value</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_HI_OUT</name>
                            <description>Set output level (1/0 -&gt; high/low) for QSPI IO0...5. 
                            Reading back gives the last value written, NOT the input value from the pins. 
                            If core 0 and core 1 both write to GPIO_HI_OUT simultaneously (or to a SET/CLR/XOR alias), 
                            the result is as though the write from core 0 took place first, 
                            and the write from core 1 was then applied to that intermediate result.</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_HI_OUT_SET</name>
                    <addressOffset>0x00000034</addressOffset>
                    <description>QSPI output value set</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_HI_OUT_SET</name>
                            <description>Perform an atomic bit-set on GPIO_HI_OUT, i.e. `GPIO_HI_OUT |= wdata`</description>
                            <bitRange>[5:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_HI_OUT_CLR</name>
                    <addressOffset>0x00000038</addressOffset>
                    <description>QSPI output value clear</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_HI_OUT_CLR</name>
                            <description>Perform an atomic bit-clear on GPIO_HI_OUT, i.e. `GPIO_HI_OUT &amp;= ~wdata`</description>
                            <bitRange>[5:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_HI_OUT_XOR</name>
                    <addressOffset>0x0000003c</addressOffset>
                    <description>QSPI output value XOR</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_HI_OUT_XOR</name>
                            <description>Perform an atomic bitwise XOR on GPIO_HI_OUT, i.e. `GPIO_HI_OUT ^= wdata`</description>
                            <bitRange>[5:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_HI_OE</name>
                    <addressOffset>0x00000040</addressOffset>
                    <description>QSPI output enable</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_HI_OE</name>
                            <description>Set output enable (1/0 -&gt; output/input) for QSPI IO0...5. 
                            Reading back gives the last value written. 
                            If core 0 and core 1 both write to GPIO_HI_OE simultaneously (or to a SET/CLR/XOR alias), 
                            the result is as though the write from core 0 took place first, 
                            and the write from core 1 was then applied to that intermediate result.</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_HI_OE_SET</name>
                    <addressOffset>0x00000044</addressOffset>
                    <description>QSPI output enable set</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_HI_OE_SET</name>
                            <description>Perform an atomic bit-set on GPIO_HI_OE, i.e. `GPIO_HI_OE |= wdata`</description>
                            <bitRange>[5:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_HI_OE_CLR</name>
                    <addressOffset>0x00000048</addressOffset>
                    <description>QSPI output enable clear</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_HI_OE_CLR</name>
                            <description>Perform an atomic bit-clear on GPIO_HI_OE, i.e. `GPIO_HI_OE &amp;= ~wdata`</description>
                            <bitRange>[5:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_HI_OE_XOR</name>
                    <addressOffset>0x0000004c</addressOffset>
                    <description>QSPI output enable XOR</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_HI_OE_XOR</name>
                            <description>Perform an atomic bitwise XOR on GPIO_HI_OE, i.e. `GPIO_HI_OE ^= wdata`</description>
                            <bitRange>[5:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FIFO_ST</name>
                    <addressOffset>0x00000050</addressOffset>
                    <description>Status register for inter-core FIFOs (mailboxes). 
                    There is one FIFO in the core 0 -&gt; core 1 direction, and one core 1 -&gt; core 0. Both are 32 bits wide and 8 words deep. 
                    Core 0 can see the read side of the 1-&gt;0 FIFO (RX), and the write side of 0-&gt;1 FIFO (TX). 
                    Core 1 can see the read side of the 0-&gt;1 FIFO (RX), and the write side of 1-&gt;0 FIFO (TX). 
                    The SIO IRQ for each core is the logical OR of the VLD, WOF and ROE fields of its FIFO_ST register.</description>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <field>
                            <name>ROE</name>
                            <description>Sticky flag indicating the RX FIFO was read when empty. This read was ignored by the FIFO.</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>WOF</name>
                            <description>Sticky flag indicating the TX FIFO was written when full. This write was ignored by the FIFO.</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>RDY</name>
                            <description>Value is 1 if this core's TX FIFO is not full (i.e. if FIFO_WR is ready for more data)</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VLD</name>
                            <description>Value is 1 if this core's RX FIFO is not empty (i.e. if FIFO_RD is valid)</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FIFO_WR</name>
                    <addressOffset>0x00000054</addressOffset>
                    <description>Write access to this core's TX FIFO</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FIFO_WR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
