ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>FIFO_RD</name>
                    <addressOffset>0x00000058</addressOffset>
                    <description>Read access to this core's RX FIFO</description>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>FIFO_RD</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK_ST</name>
                    <addressOffset>0x0000005c</addressOffset>
                    <description>Spinlock state 
                    A bitmap containing the state of all 32 spinlocks (1=locked). 
                    Mainly intended for debugging.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK_ST</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV_UDIVIDEND</name>
                    <addressOffset>0x00000060</addressOffset>
                    <description>Divider unsigned dividend 
                    Write to the DIVIDEND operand of the divider, i.e. the p in `p / q`. 
                    Any operand write starts a new calculation. The results appear in QUOTIENT, REMAINDER. 
                    UDIVIDEND/SDIVIDEND are aliases of the same internal register. The U alias starts an 
                    unsigned calculation, and the S alias starts a signed calculation.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV_UDIVIDEND</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV_UDIVISOR</name>
                    <addressOffset>0x00000064</addressOffset>
                    <description>Divider unsigned divisor 
                    Write to the DIVISOR operand of the divider, i.e. the q in `p / q`. 
                    Any operand write starts a new calculation. The results appear in QUOTIENT, REMAINDER. 
                    UDIVISOR/SDIVISOR are aliases of the same internal register. The U alias starts an 
                    unsigned calculation, and the S alias starts a signed calculation.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV_UDIVISOR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV_SDIVIDEND</name>
                    <addressOffset>0x00000068</addressOffset>
                    <description>Divider signed dividend 
                    The same as UDIVIDEND, but starts a signed calculation, rather than unsigned.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV_SDIVIDEND</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV_SDIVISOR</name>
                    <addressOffset>0x0000006c</addressOffset>
                    <description>Divider signed divisor 
                    The same as UDIVISOR, but starts a signed calculation, rather than unsigned.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV_SDIVISOR</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV_QUOTIENT</name>
                    <addressOffset>0x00000070</addressOffset>
                    <description>Divider result quotient 
                    The result of `DIVIDEND / DIVISOR` (division). Contents undefined while CSR_READY is low. 
                    For signed calculations, QUOTIENT is negative when the signs of DIVIDEND and DIVISOR differ. 
                    This register can be written to directly, for context save/restore purposes. This halts any 
                    in-progress calculation and sets the CSR_READY and CSR_DIRTY flags. 
                    Reading from QUOTIENT clears the CSR_DIRTY flag, so should read results in the order 
                    REMAINDER, QUOTIENT if CSR_DIRTY is used.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV_QUOTIENT</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV_REMAINDER</name>
                    <addressOffset>0x00000074</addressOffset>
                    <description>Divider result remainder 
                    The result of `DIVIDEND % DIVISOR` (modulo). Contents undefined while CSR_READY is low. 
                    For signed calculations, REMAINDER is negative only when DIVIDEND is negative. 
                    This register can be written to directly, for context save/restore purposes. This halts any 
                    in-progress calculation and sets the CSR_READY and CSR_DIRTY flags.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV_REMAINDER</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV_CSR</name>
                    <addressOffset>0x00000078</addressOffset>
                    <description>Control and status register for divider.</description>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>DIRTY</name>
                            <description>Changes to 1 when any register is written, and back to 0 when QUOTIENT is read. 
                            Software can use this flag to make save/restore more efficient (skip if not DIRTY). 
                            If the flag is used in this way, it's recommended to either read QUOTIENT only, 
                            or REMAINDER and then QUOTIENT, to prevent data loss on context switch.</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>READY</name>
                            <description>Reads as 0 when a calculation is in progress, 1 otherwise. 
                            Writing an operand (xDIVIDEND, xDIVISOR) will immediately start a new calculation, no 
                            matter if one is already in progress. 
                            Writing to a result register will immediately terminate any in-progress calculation 
                            and set the READY and DIRTY flags.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_ACCUM0</name>
                    <addressOffset>0x00000080</addressOffset>
                    <description>Read/write access to accumulator 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_ACCUM0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_ACCUM1</name>
                    <addressOffset>0x00000084</addressOffset>
                    <description>Read/write access to accumulator 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_ACCUM1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_BASE0</name>
                    <addressOffset>0x00000088</addressOffset>
                    <description>Read/write access to BASE0 register.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_BASE0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_BASE1</name>
                    <addressOffset>0x0000008c</addressOffset>
                    <description>Read/write access to BASE1 register.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_BASE1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_BASE2</name>
                    <addressOffset>0x00000090</addressOffset>
                    <description>Read/write access to BASE2 register.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_BASE2</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_POP_LANE0</name>
                    <addressOffset>0x00000094</addressOffset>
                    <description>Read LANE0 result, and simultaneously write lane results to both accumulators (POP).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_POP_LANE0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_POP_LANE1</name>
                    <addressOffset>0x00000098</addressOffset>
                    <description>Read LANE1 result, and simultaneously write lane results to both accumulators (POP).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_POP_LANE1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_POP_FULL</name>
                    <addressOffset>0x0000009c</addressOffset>
                    <description>Read FULL result, and simultaneously write lane results to both accumulators (POP).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_POP_FULL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_PEEK_LANE0</name>
                    <addressOffset>0x000000a0</addressOffset>
                    <description>Read LANE0 result, without altering any internal state (PEEK).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_PEEK_LANE0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_PEEK_LANE1</name>
                    <addressOffset>0x000000a4</addressOffset>
                    <description>Read LANE1 result, without altering any internal state (PEEK).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_PEEK_LANE1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_PEEK_FULL</name>
                    <addressOffset>0x000000a8</addressOffset>
                    <description>Read FULL result, without altering any internal state (PEEK).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_PEEK_FULL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_CTRL_LANE0</name>
                    <addressOffset>0x000000ac</addressOffset>
                    <description>Control register for lane 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OVERF</name>
                            <description>Set if either OVERF0 or OVERF1 is set.</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVERF1</name>
                            <description>Indicates if any masked-off MSBs in ACCUM1 are set.</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVERF0</name>
                            <description>Indicates if any masked-off MSBs in ACCUM0 are set.</description>
                            <bitRange>[23:23]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLEND</name>
                            <description>Only present on INTERP0 on each core. If BLEND mode is enabled: 
                            - LANE1 result is a linear interpolation between BASE0 and BASE1, controlled 
                            by the 8 LSBs of lane 1 shift and mask value (a fractional number between 
                            0 and 255/256ths) 
                            - LANE0 result does not have BASE0 added (yields only the 8 LSBs of lane 1 shift+mask value) 
                            - FULL result does not have lane 1 shift+mask value added (BASE2 + lane 0 shift+mask) 
                            LANE1 SIGNED flag controls whether the interpolation is signed or unsigned.</description>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCE_MSB</name>
                            <description>ORed into bits 29:28 of the lane result presented to the processor on the bus. 
                            No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence 
                            of pointers into flash or SRAM.</description>
                            <bitRange>[20:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADD_RAW</name>
                            <description>If 1, mask + shift is bypassed for LANE0 result. This does not affect FULL result.</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CROSS_RESULT</name>
                            <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CROSS_INPUT</name>
                            <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware. 
                            Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIGNED</name>
                            <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits 
                            before adding to BASE0, and LANE0 PEEK/POP appear extended to 32 bits when read by processor.</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK_MSB</name>
                            <description>The most-significant bit allowed to pass by the mask (inclusive) 
                            Setting MSB &lt; LSB may cause chip to turn inside-out</description>
                            <bitRange>[14:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK_LSB</name>
                            <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
                            <bitRange>[9:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SHIFT</name>
                            <description>Logical right-shift applied to accumulator before masking</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
