ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>INTERP0_CTRL_LANE1</name>
                    <addressOffset>0x000000b0</addressOffset>
                    <description>Control register for lane 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FORCE_MSB</name>
                            <description>ORed into bits 29:28 of the lane result presented to the processor on the bus. 
                            No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence 
                            of pointers into flash or SRAM.</description>
                            <bitRange>[20:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADD_RAW</name>
                            <description>If 1, mask + shift is bypassed for LANE1 result. This does not affect FULL result.</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CROSS_RESULT</name>
                            <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CROSS_INPUT</name>
                            <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware. 
                            Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIGNED</name>
                            <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits 
                            before adding to BASE1, and LANE1 PEEK/POP appear extended to 32 bits when read by processor.</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK_MSB</name>
                            <description>The most-significant bit allowed to pass by the mask (inclusive) 
                            Setting MSB &lt; LSB may cause chip to turn inside-out</description>
                            <bitRange>[14:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK_LSB</name>
                            <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
                            <bitRange>[9:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SHIFT</name>
                            <description>Logical right-shift applied to accumulator before masking</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_ACCUM0_ADD</name>
                    <addressOffset>0x000000b4</addressOffset>
                    <description>Values written here are atomically added to ACCUM0 
                    Reading yields lane 0's raw shift and mask value (BASE0 not added).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_ACCUM0_ADD</name>
                            <bitRange>[23:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_ACCUM1_ADD</name>
                    <addressOffset>0x000000b8</addressOffset>
                    <description>Values written here are atomically added to ACCUM1 
                    Reading yields lane 1's raw shift and mask value (BASE1 not added).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_ACCUM1_ADD</name>
                            <bitRange>[23:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP0_BASE_1AND0</name>
                    <addressOffset>0x000000bc</addressOffset>
                    <description>On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously. 
                    Each half is sign-extended to 32 bits if that lane's SIGNED flag is set.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP0_BASE_1AND0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_ACCUM0</name>
                    <addressOffset>0x000000c0</addressOffset>
                    <description>Read/write access to accumulator 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_ACCUM0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_ACCUM1</name>
                    <addressOffset>0x000000c4</addressOffset>
                    <description>Read/write access to accumulator 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_ACCUM1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_BASE0</name>
                    <addressOffset>0x000000c8</addressOffset>
                    <description>Read/write access to BASE0 register.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_BASE0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_BASE1</name>
                    <addressOffset>0x000000cc</addressOffset>
                    <description>Read/write access to BASE1 register.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_BASE1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_BASE2</name>
                    <addressOffset>0x000000d0</addressOffset>
                    <description>Read/write access to BASE2 register.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_BASE2</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_POP_LANE0</name>
                    <addressOffset>0x000000d4</addressOffset>
                    <description>Read LANE0 result, and simultaneously write lane results to both accumulators (POP).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_POP_LANE0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_POP_LANE1</name>
                    <addressOffset>0x000000d8</addressOffset>
                    <description>Read LANE1 result, and simultaneously write lane results to both accumulators (POP).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_POP_LANE1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_POP_FULL</name>
                    <addressOffset>0x000000dc</addressOffset>
                    <description>Read FULL result, and simultaneously write lane results to both accumulators (POP).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_POP_FULL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_PEEK_LANE0</name>
                    <addressOffset>0x000000e0</addressOffset>
                    <description>Read LANE0 result, without altering any internal state (PEEK).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_PEEK_LANE0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_PEEK_LANE1</name>
                    <addressOffset>0x000000e4</addressOffset>
                    <description>Read LANE1 result, without altering any internal state (PEEK).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_PEEK_LANE1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_PEEK_FULL</name>
                    <addressOffset>0x000000e8</addressOffset>
                    <description>Read FULL result, without altering any internal state (PEEK).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_PEEK_FULL</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_CTRL_LANE0</name>
                    <addressOffset>0x000000ec</addressOffset>
                    <description>Control register for lane 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OVERF</name>
                            <description>Set if either OVERF0 or OVERF1 is set.</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVERF1</name>
                            <description>Indicates if any masked-off MSBs in ACCUM1 are set.</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVERF0</name>
                            <description>Indicates if any masked-off MSBs in ACCUM0 are set.</description>
                            <bitRange>[23:23]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CLAMP</name>
                            <description>Only present on INTERP1 on each core. If CLAMP mode is enabled: 
                            - LANE0 result is shifted and masked ACCUM0, clamped by a lower bound of 
                            BASE0 and an upper bound of BASE1. 
                            - Signedness of these comparisons is determined by LANE0_CTRL_SIGNED</description>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCE_MSB</name>
                            <description>ORed into bits 29:28 of the lane result presented to the processor on the bus. 
                            No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence 
                            of pointers into flash or SRAM.</description>
                            <bitRange>[20:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADD_RAW</name>
                            <description>If 1, mask + shift is bypassed for LANE0 result. This does not affect FULL result.</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CROSS_RESULT</name>
                            <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CROSS_INPUT</name>
                            <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware. 
                            Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIGNED</name>
                            <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits 
                            before adding to BASE0, and LANE0 PEEK/POP appear extended to 32 bits when read by processor.</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK_MSB</name>
                            <description>The most-significant bit allowed to pass by the mask (inclusive) 
                            Setting MSB &lt; LSB may cause chip to turn inside-out</description>
                            <bitRange>[14:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK_LSB</name>
                            <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
                            <bitRange>[9:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SHIFT</name>
                            <description>Logical right-shift applied to accumulator before masking</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_CTRL_LANE1</name>
                    <addressOffset>0x000000f0</addressOffset>
                    <description>Control register for lane 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FORCE_MSB</name>
                            <description>ORed into bits 29:28 of the lane result presented to the processor on the bus. 
                            No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence 
                            of pointers into flash or SRAM.</description>
                            <bitRange>[20:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADD_RAW</name>
                            <description>If 1, mask + shift is bypassed for LANE1 result. This does not affect FULL result.</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CROSS_RESULT</name>
                            <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CROSS_INPUT</name>
                            <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware. 
                            Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIGNED</name>
                            <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits 
                            before adding to BASE1, and LANE1 PEEK/POP appear extended to 32 bits when read by processor.</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK_MSB</name>
                            <description>The most-significant bit allowed to pass by the mask (inclusive) 
                            Setting MSB &lt; LSB may cause chip to turn inside-out</description>
                            <bitRange>[14:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK_LSB</name>
                            <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
                            <bitRange>[9:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SHIFT</name>
                            <description>Logical right-shift applied to accumulator before masking</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_ACCUM0_ADD</name>
                    <addressOffset>0x000000f4</addressOffset>
                    <description>Values written here are atomically added to ACCUM0 
                    Reading yields lane 0's raw shift and mask value (BASE0 not added).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_ACCUM0_ADD</name>
                            <bitRange>[23:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_ACCUM1_ADD</name>
                    <addressOffset>0x000000f8</addressOffset>
                    <description>Values written here are atomically added to ACCUM1 
                    Reading yields lane 1's raw shift and mask value (BASE1 not added).</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_ACCUM1_ADD</name>
                            <bitRange>[23:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERP1_BASE_1AND0</name>
                    <addressOffset>0x000000fc</addressOffset>
                    <description>On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously. 
                    Each half is sign-extended to 32 bits if that lane's SIGNED flag is set.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERP1_BASE_1AND0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
