ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>SPINLOCK0</name>
                    <addressOffset>0x00000100</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK0</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK1</name>
                    <addressOffset>0x00000104</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK1</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK2</name>
                    <addressOffset>0x00000108</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK2</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK3</name>
                    <addressOffset>0x0000010c</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK3</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK4</name>
                    <addressOffset>0x00000110</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK4</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK5</name>
                    <addressOffset>0x00000114</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK5</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK6</name>
                    <addressOffset>0x00000118</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK6</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK7</name>
                    <addressOffset>0x0000011c</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK7</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK8</name>
                    <addressOffset>0x00000120</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK8</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK9</name>
                    <addressOffset>0x00000124</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK9</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK10</name>
                    <addressOffset>0x00000128</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK10</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK11</name>
                    <addressOffset>0x0000012c</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK11</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK12</name>
                    <addressOffset>0x00000130</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK12</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK13</name>
                    <addressOffset>0x00000134</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK13</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK14</name>
                    <addressOffset>0x00000138</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK14</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK15</name>
                    <addressOffset>0x0000013c</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK15</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK16</name>
                    <addressOffset>0x00000140</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK16</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK17</name>
                    <addressOffset>0x00000144</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK17</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK18</name>
                    <addressOffset>0x00000148</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK18</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK19</name>
                    <addressOffset>0x0000014c</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK19</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK20</name>
                    <addressOffset>0x00000150</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK20</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK21</name>
                    <addressOffset>0x00000154</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK21</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK22</name>
                    <addressOffset>0x00000158</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK22</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
