ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>SPINLOCK23</name>
                    <addressOffset>0x0000015c</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK23</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK24</name>
                    <addressOffset>0x00000160</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK24</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK25</name>
                    <addressOffset>0x00000164</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK25</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK26</name>
                    <addressOffset>0x00000168</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK26</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK27</name>
                    <addressOffset>0x0000016c</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK27</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK28</name>
                    <addressOffset>0x00000170</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK28</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK29</name>
                    <addressOffset>0x00000174</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK29</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK30</name>
                    <addressOffset>0x00000178</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK30</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPINLOCK31</name>
                    <addressOffset>0x0000017c</addressOffset>
                    <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPINLOCK31</name>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
