ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>ADDR_ENDP14</name>
                    <addressOffset>0x00000038</addressOffset>
                    <description>Interrupt endpoint 14. Only valid for HOST mode.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTEP_PREAMBLE</name>
                            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTEP_DIR</name>
                            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDPOINT</name>
                            <description>Endpoint number of the interrupt endpoint</description>
                            <bitRange>[19:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRESS</name>
                            <description>Device address</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR_ENDP15</name>
                    <addressOffset>0x0000003c</addressOffset>
                    <description>Interrupt endpoint 15. Only valid for HOST mode.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTEP_PREAMBLE</name>
                            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTEP_DIR</name>
                            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDPOINT</name>
                            <description>Endpoint number of the interrupt endpoint</description>
                            <bitRange>[19:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRESS</name>
                            <description>Device address</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAIN_CTRL</name>
                    <addressOffset>0x00000040</addressOffset>
                    <description>Main control register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SIM_TIMING</name>
                            <description>Reduced timings for simulation</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HOST_NDEVICE</name>
                            <description>Device mode = 0, Host mode = 1</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CONTROLLER_EN</name>
                            <description>Enable controller</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOF_WR</name>
                    <addressOffset>0x00000044</addressOffset>
                    <description>Set the SOF (Start of Frame) frame number in the host controller. The SOF packet is sent every 1ms and the host will increment the frame number by 1 each time.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>COUNT</name>
                            <bitRange>[10:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOF_RD</name>
                    <addressOffset>0x00000048</addressOffset>
                    <description>Read the last SOF (Start of Frame) frame number seen. In device mode the last SOF received from the host. In host mode the last SOF sent by the host.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>COUNT</name>
                            <bitRange>[10:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SIE_CTRL</name>
                    <addressOffset>0x0000004c</addressOffset>
                    <description>SIE control register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EP0_INT_STALL</name>
                            <description>Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a STALL</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP0_DOUBLE_BUF</name>
                            <description>Device: EP0 single buffered = 0, double buffered = 1</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP0_INT_1BUF</name>
                            <description>Device: Set bit in BUFF_STATUS for every buffer completed on EP0</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP0_INT_2BUF</name>
                            <description>Device: Set bit in BUFF_STATUS for every 2 buffers completed on EP0</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP0_INT_NAK</name>
                            <description>Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a NAK</description>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIRECT_EN</name>
                            <description>Direct bus drive enable</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIRECT_DP</name>
                            <description>Direct control of DP</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIRECT_DM</name>
                            <description>Direct control of DM</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRANSCEIVER_PD</name>
                            <description>Power down bus transceiver</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPU_OPT</name>
                            <description>Device: Pull-up strength (0=1K2, 1=2k3)</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PULLUP_EN</name>
                            <description>Device: Enable pull up resistor</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PULLDOWN_EN</name>
                            <description>Host: Enable pull down resistors</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESET_BUS</name>
                            <description>Host: Reset bus</description>
                            <bitRange>[13:13]</bitRange>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RESUME</name>
                            <description>Device: Remote wakeup. Device can initiate its own resume after suspend.</description>
                            <bitRange>[12:12]</bitRange>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>VBUS_EN</name>
                            <description>Host: Enable VBUS</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KEEP_ALIVE_EN</name>
                            <description>Host: Enable keep alive packet (for low speed bus)</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOF_EN</name>
                            <description>Host: Enable SOF generation (for full speed bus)</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOF_SYNC</name>
                            <description>Host: Delay packet(s) until after SOF</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PREAMBLE_EN</name>
                            <description>Host: Preable enable for LS device on FS hub</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STOP_TRANS</name>
                            <description>Host: Stop transaction</description>
                            <bitRange>[4:4]</bitRange>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RECEIVE_DATA</name>
                            <description>Host: Receive transaction (IN to host)</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEND_DATA</name>
                            <description>Host: Send transaction (OUT from host)</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEND_SETUP</name>
                            <description>Host: Send Setup packet</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>START_TRANS</name>
                            <description>Host: Start transaction</description>
                            <bitRange>[0:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SIE_STATUS</name>
                    <addressOffset>0x00000050</addressOffset>
                    <description>SIE status register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA_SEQ_ERROR</name>
                            <description>Data Sequence Error.

                            The device can raise a sequence error in the following conditions:

                            * A SETUP packet is received followed by a DATA1 packet (data phase should always be DATA0) * An OUT packet is received from the host but doesn't match the data pid in the buffer control register read from DPSRAM

                            The host can raise a data sequence error in the following conditions:

