ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                            * An IN packet from the device has the wrong data PID</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>ACK_REC</name>
                            <description>ACK received. Raised by both host and device.</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>STALL_REC</name>
                            <description>Host: STALL received</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>NAK_REC</name>
                            <description>Host: NAK received</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>RX_TIMEOUT</name>
                            <description>RX timeout is raised by both the host and device if an ACK is not received in the maximum time specified by the USB spec.</description>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>RX_OVERFLOW</name>
                            <description>RX overflow is raised by the Serial RX engine if the incoming data is too fast.</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>BIT_STUFF_ERROR</name>
                            <description>Bit Stuff Error. Raised by the Serial RX engine.</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>CRC_ERROR</name>
                            <description>CRC Error. Raised by the Serial RX engine.</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>BUS_RESET</name>
                            <description>Device: bus reset received</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>TRANS_COMPLETE</name>
                            <description>Transaction complete.

                            Raised by device if:

                            * An IN or OUT packet is sent with the `LAST_BUFF` bit set in the buffer control register

                            Raised by host if:

                            * A setup packet is sent when no data in or data out transaction follows * An IN packet is received and the `LAST_BUFF` bit is set in the buffer control register * An IN packet is received with zero length * An OUT packet is sent and the `LAST_BUFF` bit is set</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>SETUP_REC</name>
                            <description>Device: Setup packet received</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>CONNECTED</name>
                            <description>Device: connected</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESUME</name>
                            <description>Host: Device has initiated a remote resume. Device: host has initiated a resume.</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>VBUS_OVER_CURR</name>
                            <description>VBUS over current detected</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SPEED</name>
                            <description>Host: device speed. Disconnected = 00, LS = 01, FS = 10</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SUSPENDED</name>
                            <description>Bus in suspended state. Valid for device and host. Host and device will go into suspend if neither Keep Alive / SOF frames are enabled.</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LINE_STATE</name>
                            <description>USB bus line state</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VBUS_DETECTED</name>
                            <description>Device: VBUS Detected</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EP_CTRL</name>
                    <addressOffset>0x00000054</addressOffset>
                    <description>interrupt endpoint control register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EP_ACTIVE</name>
                            <description>Host: Enable interrupt endpoint 1 =&gt; 15</description>
                            <bitRange>[15:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUFF_STATUS</name>
                    <addressOffset>0x00000058</addressOffset>
                    <description>Buffer status register. A bit set here indicates that a buffer has completed on the endpoint (if the buffer interrupt is enabled). It is possible for 2 buffers to be completed, so clearing the buffer status bit may instantly re set it on the next clock cycle.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EP15_OUT</name>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP15_IN</name>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP14_OUT</name>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP14_IN</name>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP13_OUT</name>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP13_IN</name>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP12_OUT</name>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP12_IN</name>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP11_OUT</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP11_IN</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP10_OUT</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP10_IN</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP9_OUT</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP9_IN</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP8_OUT</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP8_IN</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP7_OUT</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP7_IN</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP6_OUT</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP6_IN</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP5_OUT</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP5_IN</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP4_OUT</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP4_IN</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP3_OUT</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP3_IN</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP2_OUT</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP2_IN</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP1_OUT</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP1_IN</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP0_OUT</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>EP0_IN</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
