ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>BUFF_CPU_SHOULD_HANDLE</name>
                    <addressOffset>0x0000005c</addressOffset>
                    <description>Which of the double buffers should be handled. Only valid if using an interrupt per buffer (i.e. not per 2 buffers). Not valid for host interrupt endpoint polling because they are only single buffered.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EP15_OUT</name>
                            <bitRange>[31:31]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP15_IN</name>
                            <bitRange>[30:30]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP14_OUT</name>
                            <bitRange>[29:29]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP14_IN</name>
                            <bitRange>[28:28]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP13_OUT</name>
                            <bitRange>[27:27]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP13_IN</name>
                            <bitRange>[26:26]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP12_OUT</name>
                            <bitRange>[25:25]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP12_IN</name>
                            <bitRange>[24:24]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP11_OUT</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP11_IN</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP10_OUT</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP10_IN</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP9_OUT</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP9_IN</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP8_OUT</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP8_IN</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP7_OUT</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP7_IN</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP6_OUT</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP6_IN</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP5_OUT</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP5_IN</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP4_OUT</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP4_IN</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP3_OUT</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP3_IN</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP2_OUT</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP2_IN</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP1_OUT</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP1_IN</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP0_OUT</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP0_IN</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EP_ABORT</name>
                    <addressOffset>0x00000060</addressOffset>
                    <description>Device only: Can be set to ignore the buffer control register for this endpoint in case you would like to revoke a buffer. A NAK will be sent for every access to the endpoint until this bit is cleared. A corresponding bit in `EP_ABORT_DONE` is set when it is safe to modify the buffer control register.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EP15_OUT</name>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP15_IN</name>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP14_OUT</name>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP14_IN</name>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP13_OUT</name>
                            <bitRange>[27:27]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP13_IN</name>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP12_OUT</name>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP12_IN</name>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP11_OUT</name>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP11_IN</name>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP10_OUT</name>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP10_IN</name>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP9_OUT</name>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP9_IN</name>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP8_OUT</name>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP8_IN</name>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP7_OUT</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP7_IN</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP6_OUT</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP6_IN</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP5_OUT</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP5_IN</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP4_OUT</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP4_IN</name>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP3_OUT</name>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP3_IN</name>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP2_OUT</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP2_IN</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP1_OUT</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP1_IN</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP0_OUT</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EP0_IN</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
