ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
                <register>
                    <name>USB_MUXING</name>
                    <addressOffset>0x00000074</addressOffset>
                    <description>Where to connect the USB controller. Should be to_phy by default.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SOFTCON</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TO_DIGITAL_PAD</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TO_EXTPHY</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TO_PHY</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_PWR</name>
                    <addressOffset>0x00000078</addressOffset>
                    <description>Overrides for the power signals in the event that the VBUS signals are not hooked up to GPIO. Set the value of the override and then the override enable so switch over to the override value.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OVERCURR_DETECT_EN</name>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVERCURR_DETECT</name>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBUS_DETECT_OVERRIDE_EN</name>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBUS_DETECT</name>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBUS_EN_OVERRIDE_EN</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBUS_EN</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBPHY_DIRECT</name>
                    <addressOffset>0x0000007c</addressOffset>
                    <description>Note that most functions are driven directly from usb_fsls controller.  This register allows more detailed control/status from the USB PHY. Useful for debug but not expected to be used in normal operation 
                    Use in conjunction with usbphy_direct_override register</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DM_OVV</name>
                            <description>Status bit from USB PHY</description>
                            <bitRange>[22:22]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DP_OVV</name>
                            <description>Status bit from USB PHY</description>
                            <bitRange>[21:21]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DM_OVCN</name>
                            <description>Status bit from USB PHY</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DP_OVCN</name>
                            <description>Status bit from USB PHY</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RX_DM</name>
                            <description>Status bit from USB PHY 
                            DPM pin state</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RX_DP</name>
                            <description>Status bit from USB PHY 
                            DPP pin state</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RX_DD</name>
                            <description>Status bit from USB PHY 
                            RX Diff data</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TX_DIFFMODE</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_FSSLEW</name>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_PD</name>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RX_PD</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_DM</name>
                            <description>Value to drive to USB PHY when override enable is set (which will override the default value or value driven from USB controller 
                            TX_SEMODE=0, Ignored 
                            TX_SEMODE=1, Drives DPM only. TX_DM_OE=1 to enable drive. DPM=TX_DM</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_DP</name>
                            <description>Value to drive to USB PHY when override enable is set (which will override the default value or value driven from USB controller 
                            TX_SEMODE=0, Drives DPP/DPM diff pair. TX_DP_OE=1 to enable drive. DPP=TX_DP, DPM=~TX_DP 
                            TX_SEMODE=1, Drives DPP only. TX_DP_OE=1 to enable drive. DPP=TX_DP</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_DM_OE</name>
                            <description>Value to drive to USB PHY when override enable is set (which will override the default value or value driven from USB controller 
                            TX_SEMODE=0, Ignored. 
                            TX_SEMODE=1, OE for DPM only. 0 - DPM in Hi-Z state; 1 - DPM driving</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_DP_OE</name>
                            <description>Value to drive to USB PHY when override enable is set (which will override the default value or value driven from USB controller 
                            TX_SEMODE=0, OE for DPP/DPM diff pair. 0 - DPP/DPM in Hi-Z state; 1 - DPP/DPM driving 
                            TX_SEMODE=1, OE for DPP only. 0 - DPP in Hi-Z state; 1 - DPP driving</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DM_PULLDN_EN</name>
                            <description>Value to drive to USB PHY when override enable is set (which will override the default value or value driven from USB controller 
                            1 - Enable Rpd on DPM</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DM_PULLUP_EN</name>
                            <description>Value to drive to USB PHY when override enable is set (which will override the default value or value driven from USB controller 
                            1 - Enable Rpu on DPM</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DM_PULLUP_HISEL</name>
                            <description>when dm_pullup_en is set high, this enables second resistor. 0 - Pull = Rpu2; 1 - Pull = Rpu1 + Rpu2</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DP_PULLDN_EN</name>
                            <description>Value to drive to USB PHY when override enable is set (which will override the default value or value driven from USB controller 
                            1 - Enable Rpd on DPP</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DP_PULLUP_EN</name>
                            <description>Value to drive to USB PHY when override enable is set (which will override the default value or value driven from USB controller</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DP_PULLUP_HISEL</name>
                            <description>when dp_pullup_en is set high, this enables second resistor. 0 - Pull = Rpu2; 1 - Pull = Rpu1 + Rpu2</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBPHY_DIRECT_OVERRIDE</name>
                    <addressOffset>0x00000080</addressOffset>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TX_DIFFMODE_OVERRIDE_EN</name>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DM_PULLUP_OVERRIDE_EN</name>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_FSSLEW_OVERRIDE_EN</name>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_PD_OVERRIDE_EN</name>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RX_PD_OVERRIDE_EN</name>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_DM_OVERRIDE_EN</name>
                            <description>Override default value or value driven from USB Controller to PHY</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_DP_OVERRIDE_EN</name>
                            <description>Override default value or value driven from USB Controller to PHY</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_DM_OE_OVERRIDE_EN</name>
                            <description>Override default value or value driven from USB Controller to PHY</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX_DP_OE_OVERRIDE_EN</name>
                            <description>Override default value or value driven from USB Controller to PHY</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DM_PULLDN_EN_OVERRIDE_EN</name>
                            <description>Override default value or value driven from USB Controller to PHY</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DP_PULLDN_EN_OVERRIDE_EN</name>
                            <description>Override default value or value driven from USB Controller to PHY</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DP_PULLUP_EN_OVERRIDE_EN</name>
                            <description>Override default value or value driven from USB Controller to PHY</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DM_PULLUP_HISEL_OVERRIDE_EN</name>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DP_PULLUP_HISEL_OVERRIDE_EN</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBPHY_TRIM</name>
                    <addressOffset>0x00000084</addressOffset>
                    <description>Note that most functions are driven directly from usb_fsls controller.  This register allows more detailed control/status from the USB PHY. Useful for debug but not expected to be used in normal operation</description>
                    <resetValue>0x00001f1f</resetValue>
                    <fields>
                        <field>
                            <name>DM_PULLDN_TRIM</name>
                            <description>Value to drive to USB PHY 
                            DM pulldown resistor trim control 
                            Experimental data suggests that the reset value will work, but this register allows adjustment if required</description>
                            <bitRange>[12:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DP_PULLDN_TRIM</name>
                            <description>Value to drive to USB PHY 
                            DP pulldown resistor trim control 
                            Experimental data suggests that the reset value will work, but this register allows adjustment if required</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
