ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>USB_DPRAM</name>
            <description>DPRAM layout for USB device.</description>
            <baseAddress>0x50100000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>256</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SETUP_PACKET_LOW</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Bytes 0-3 of the SETUP packet from the host.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WVALUE</name>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BREQUEST</name>
                            <bitRange>[15:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BMREQUESTTYPE</name>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SETUP_PACKET_HIGH</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>Bytes 4-7 of the setup packet from the host.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WLENGTH</name>
                            <bitRange>[31:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WINDEX</name>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EP1_IN_CONTROL</name>
                    <addressOffset>0x00000008</addressOffset>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DOUBLE_BUFFERED</name>
                            <description>This endpoint is double buffered.</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_BUFF</name>
                            <description>Trigger an interrupt each time a buffer is done.</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                            <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDPOINT_TYPE</name>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Control</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Isochronous</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Bulk</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Interrupt</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_STALL</name>
                            <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_NAK</name>
                            <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFFER_ADDRESS</name>
                            <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EP1_OUT_CONTROL</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DOUBLE_BUFFERED</name>
                            <description>This endpoint is double buffered.</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_BUFF</name>
                            <description>Trigger an interrupt each time a buffer is done.</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                            <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDPOINT_TYPE</name>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Control</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Isochronous</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Bulk</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Interrupt</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_STALL</name>
                            <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_NAK</name>
                            <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFFER_ADDRESS</name>
                            <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EP2_IN_CONTROL</name>
                    <addressOffset>0x00000010</addressOffset>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DOUBLE_BUFFERED</name>
                            <description>This endpoint is double buffered.</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_BUFF</name>
                            <description>Trigger an interrupt each time a buffer is done.</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                            <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDPOINT_TYPE</name>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Control</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Isochronous</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Bulk</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Interrupt</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_STALL</name>
                            <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_NAK</name>
                            <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFFER_ADDRESS</name>
                            <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EP2_OUT_CONTROL</name>
                    <addressOffset>0x00000014</addressOffset>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DOUBLE_BUFFERED</name>
                            <description>This endpoint is double buffered.</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_BUFF</name>
                            <description>Trigger an interrupt each time a buffer is done.</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                            <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDPOINT_TYPE</name>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Control</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Isochronous</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Bulk</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Interrupt</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_STALL</name>
                            <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_NAK</name>
                            <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFFER_ADDRESS</name>
                            <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EP3_IN_CONTROL</name>
                    <addressOffset>0x00000018</addressOffset>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DOUBLE_BUFFERED</name>
                            <description>This endpoint is double buffered.</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_BUFF</name>
                            <description>Trigger an interrupt each time a buffer is done.</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                            <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDPOINT_TYPE</name>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Control</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Isochronous</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Bulk</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Interrupt</name>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_STALL</name>
                            <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTERRUPT_ON_NAK</name>
                            <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFFER_ADDRESS</name>
                            <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
