ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>TBMAN</name>
            <description>Testbench manager. Allows the programmer to know what platform their software is running on.</description>
            <baseAddress>0x4006c000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PLATFORM</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Indicates the type of platform in use</description>
                    <resetValue>0x00000005</resetValue>
                    <fields>
                        <field>
                            <name>FPGA</name>
                            <description>Indicates the platform is an FPGA</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ASIC</name>
                            <description>Indicates the platform is an ASIC</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>VREG_AND_CHIP_RESET</name>
            <description>control and status for on-chip voltage regulator and chip level reset subsystem</description>
            <baseAddress>0x40064000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>VREG</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Voltage regulator control and status</description>
                    <resetValue>0x000000b1</resetValue>
                    <fields>
                        <field>
                            <name>ROK</name>
                            <description>regulation status 
                            0=not in regulation, 1=in regulation</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VSEL</name>
                            <description>output voltage select 
                            0000 to 0101 - 0.80V 
                            0110         - 0.85V 
                            0111         - 0.90V 
                            1000         - 0.95V 
                            1001         - 1.00V 
                            1010         - 1.05V 
                            1011         - 1.10V (default) 
                            1100         - 1.15V 
                            1101         - 1.20V 
                            1110         - 1.25V 
                            1111         - 1.30V</description>
                            <bitRange>[7:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HIZ</name>
                            <description>high impedance mode select 
                            0=not in high impedance mode, 1=in high impedance mode</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>enable 
                            0=not enabled, 1=enabled</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BOD</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>brown-out detection control</description>
                    <resetValue>0x00000091</resetValue>
                    <fields>
                        <field>
                            <name>VSEL</name>
                            <description>threshold select 
                            0000 - 0.473V 
                            0001 - 0.516V 
                            0010 - 0.559V 
                            0011 - 0.602V 
                            0100 - 0.645V 
                            0101 - 0.688V 
                            0110 - 0.731V 
                            0111 - 0.774V 
                            1000 - 0.817V 
                            1001 - 0.860V (default) 
                            1010 - 0.903V 
                            1011 - 0.946V 
                            1100 - 0.989V 
                            1101 - 1.032V 
                            1110 - 1.075V 
                            1111 - 1.118V</description>
                            <bitRange>[7:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>enable 
                            0=not enabled, 1=enabled</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHIP_RESET</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>Chip reset control and status</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PSM_RESTART_FLAG</name>
                            <description>This is set by psm_restart from the debugger. 
                            Its purpose is to branch bootcode to a safe mode when the debugger has issued a psm_restart in order to recover from a boot lock-up. 
                            In the safe mode the debugger can repair the boot code, clear this flag then reboot the processor.</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                        </field>
                        <field>
                            <name>HAD_PSM_RESTART</name>
                            <description>Last reset was from the debug port</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HAD_RUN</name>
                            <description>Last reset was from the RUN pin</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HAD_POR</name>
                            <description>Last reset was from the power-on reset or brown-out detection blocks</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
