ygrayne/oberon-rtk/targets/svd/rp2040-merged.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>RTC</name>
            <description>Register block to control RTC</description>
            <baseAddress>0x4005c000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RTC_IRQ</name>
                <value>25</value>
            </interrupt>
            <registers>
                <register>
                    <name>CLKDIV_M1</name>
                    <addressOffset>0x00000000</addressOffset>
                    <description>Divider minus 1 for the 1 second counter. Safe to change the value when RTC is not enabled.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKDIV_M1</name>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SETUP_0</name>
                    <addressOffset>0x00000004</addressOffset>
                    <description>RTC setup register 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>YEAR</name>
                            <description>Year</description>
                            <bitRange>[23:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MONTH</name>
                            <description>Month (1..12)</description>
                            <bitRange>[11:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAY</name>
                            <description>Day of the month (1..31)</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SETUP_1</name>
                    <addressOffset>0x00000008</addressOffset>
                    <description>RTC setup register 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DOTW</name>
                            <description>Day of the week: 1-Monday...0-Sunday ISO 8601 mod 7</description>
                            <bitRange>[26:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HOUR</name>
                            <description>Hours</description>
                            <bitRange>[20:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIN</name>
                            <description>Minutes</description>
                            <bitRange>[13:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEC</name>
                            <description>Seconds</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL</name>
                    <addressOffset>0x0000000c</addressOffset>
                    <description>RTC Control and status</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FORCE_NOTLEAPYEAR</name>
                            <description>If set, leapyear is forced off. 
                            Useful for years divisible by 100 but not by 400</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LOAD</name>
                            <description>Load RTC</description>
                            <bitRange>[4:4]</bitRange>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RTC_ACTIVE</name>
                            <description>RTC enabled (running)</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RTC_ENABLE</name>
                            <description>Enable RTC</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ_SETUP_0</name>
                    <addressOffset>0x00000010</addressOffset>
                    <description>Interrupt setup register 0</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MATCH_ACTIVE</name>
                            <bitRange>[29:29]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MATCH_ENA</name>
                            <description>Global match enable. Don't change any other value while this one is enabled</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>YEAR_ENA</name>
                            <description>Enable year matching</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MONTH_ENA</name>
                            <description>Enable month matching</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAY_ENA</name>
                            <description>Enable day matching</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>YEAR</name>
                            <description>Year</description>
                            <bitRange>[23:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MONTH</name>
                            <description>Month (1..12)</description>
                            <bitRange>[11:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAY</name>
                            <description>Day of the month (1..31)</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ_SETUP_1</name>
                    <addressOffset>0x00000014</addressOffset>
                    <description>Interrupt setup register 1</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DOTW_ENA</name>
                            <description>Enable day of the week matching</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HOUR_ENA</name>
                            <description>Enable hour matching</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIN_ENA</name>
                            <description>Enable minute matching</description>
                            <bitRange>[29:29]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEC_ENA</name>
                            <description>Enable second matching</description>
                            <bitRange>[28:28]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DOTW</name>
                            <description>Day of the week</description>
                            <bitRange>[26:24]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HOUR</name>
                            <description>Hours</description>
                            <bitRange>[20:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIN</name>
                            <description>Minutes</description>
                            <bitRange>[13:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEC</name>
                            <description>Seconds</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_1</name>
                    <addressOffset>0x00000018</addressOffset>
                    <description>RTC register 1.</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>YEAR</name>
                            <description>Year</description>
                            <bitRange>[23:12]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MONTH</name>
                            <description>Month (1..12)</description>
                            <bitRange>[11:8]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DAY</name>
                            <description>Day of the month (1..31)</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_0</name>
                    <addressOffset>0x0000001c</addressOffset>
                    <description>RTC register 0 
                    Read this before RTC 1!</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DOTW</name>
                            <description>Day of the week</description>
                            <bitRange>[26:24]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>HOUR</name>
                            <description>Hours</description>
                            <bitRange>[20:16]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>MIN</name>
                            <description>Minutes</description>
                            <bitRange>[13:8]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>SEC</name>
                            <description>Seconds</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-only</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTR</name>
                    <addressOffset>0x00000020</addressOffset>
                    <description>Raw Interrupts</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTE</name>
                    <addressOffset>0x00000024</addressOffset>
                    <description>Interrupt Enable</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF</name>
                    <addressOffset>0x00000028</addressOffset>
                    <description>Interrupt Force</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTS</name>
                    <addressOffset>0x0000002c</addressOffset>
                    <description>Interrupt status after masking &amp; forcing</description>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC</name>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>SPARE_IRQ</name>
            <baseAddress>0x00000000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>4</size>
                <usage>reserved</usage>
            </addressBlock>
            <interrupt>
                <name>SPARE_IRQ_0</name>
                <value>26</value>
            </interrupt>
            <interrupt>
                <name>SPARE_IRQ_1</name>
                <value>27</value>
            </interrupt>
            <interrupt>
                <name>SPARE_IRQ_2</name>
                <value>28</value>
            </interrupt>
            <interrupt>
                <name>SPARE_IRQ_3</name>
                <value>29</value>
            </interrupt>
            <interrupt>
                <name>SPARE_IRQ_4</name>
                <value>30</value>
            </interrupt>
            <interrupt>
                <name>SPARE_IRQ_5</name>
                <value>31</value>
            </interrupt>
        </peripheral>
    </peripherals>
</device>